Repository: ministryofjustice/laa-access-civil-legal-aid
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Enter the other income your partner receives, or 0 if this doesn't apply
cy: Rhowch yr incwm arall mae eich partner yn ei dderbyn, neu 0 os nad yw hyn yn berthnasol

source: Tell us how often your partner receives this other income
cy: Dywedwch wrthym pa mor aml mae eich partner yn derbyn yr incwm arall hwn

source: Tell us how much other income your partner receives
cy: Dywedwch wrthym faint o incwm arall mae eich partner yn ei dderbyn

source: Enter the Working Tax Credit you receive, or 0 if this doesn’t apply to you
cy: Rhowch y Credyd Treth Gwaith rydych chi’n ei dderbyn, neu 0 os nad yw’n berthnasol i chi

source: Enter the Working Tax Credit your partner receives, or 0 if it doesn’t apply
cy: Rhowch y Credyd Treth Gwaith mae eich partner yn ei dderbyn, neu 0 os nad yw’n berthnasol

source: Your outgoings
cy: Eich taliadau allan

source: You and your partner’s outgoings
cy: Eich alldaliadau chi a’ch partner

source: Rent
cy: Rhent

source: Money you pay your landlord for rent. Do not include rent that is paid by Housing Benefit.
cy: Arian rydych chi'n ei dalu i'ch landlord am rent. Peidiwch â chynnwys rhent a dalwyd gan Fudd-dal Tai

source: Money you and your partner pay your landlord for rent, or enter 0 if you don’t pay rent. Do not include rent that is paid by Housing Benefit.
cy: Arian yr ydych chi a’ch partner yn ei dalu i’ch landlord fel rhent, neu rhowch 0 os nad ydych yn talu rhent. Peidiwch â chynnwys rhent sy’n cael ei dalu gan fudd-dal tai.

source: Tell us how much rent you pay
cy: Faint rydych chi’n ei dalu mewn rhent

source: Tell us how often you pay this rent
cy: Pa mor aml rydych chi’n talu’r rhent hwn

source: Maintenance
cy: Cynhaliaeth

source: Money you pay to an ex-partner for their living costs, or enter 0 if this doesn’t apply to you
cy: Arian yr ydych chi yn ei dalu i gynbartner at gostau byw, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Money you and/or your partner pay to an ex-partner for their living costs, or enter 0 if this doesn’t apply
cy: Arian yr ydych chi a/neu’ch partner yn ei dalu i gynbartner at gostau byw, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us how much maintenance you pay
cy: Faint o arian cynhaliaeth rydych chi’n ei dalu

source: Tell us how often you pay this maintenance
cy: Pa mor aml rydych chi’n talu’r arian cynhaliaeth hwn

source: Monthly Income Contribution Order
cy: Gorchymyn Cyfrannu Incwm Misol

source: Money you pay per month towards your Criminal Legal Aid, or enter 0 if this doesn’t apply to you
cy: Arian yr ydych chi yn ei dalu at eich cymorth cyfreithiol troseddol, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Money you and/or your partner pay per month towards your Criminal Legal Aid, or enter 0 if this doesn’t apply
cy: Arian yr ydych chi a/neu’ch partner yn ei dalu at eich cymorth cyfreithiol troseddol, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us the approximate value of this property
cy: Faint yw gwerth yr eiddo hwn, yn fras

source: Childcare
cy: Gofal plant

source: Money you pay for your child to be looked after while you work or study outside of your home
cy: Arian yr ydych chi yn ei dalu i rywun warchod eich plentyn tra’r ydych chi’n gweithio neu astudio y tu allan i’ch cartref

source: Money you and your partner pay for your child to be looked after while you work or study outside of your home
cy: Arian yr ydych chi a’ch partner yn ei dalu i rywun warchod eich plentyn tra’r ydych chi’n gweithio neu astudio y tu allan i’ch cartref

source: Tell us how much you pay towards childcare
cy: Dywedwch wrthym faint rydych chi’n ei dalu tuag at ofal plant

source: Tell us how often you pay childcare costs
cy: Dywedwch wrthym pa mor aml rydych chi’n talu costau gofal plant

source: Review your answers
cy: Adolygu eich atebion

source: You can only have 1 main property
cy: Dim ond un prif Eiddo allwch chi ei gael

source: Is this property your main home?
cy: Ai’r eiddo hwn yw’ch prif gartref?

source: If you’re temporarily living away from the property, select ‘Yes’
cy: Os nad ydych chi'n byw yn yr eiddo dros dro, dewiswch 'oes'

source: Tell us whether this is your main home
cy: Ai hwn yw eich prif gartref

source: Does anyone else (other than you or your partner) own a share of the property?
cy: A oes unrhyw un arall (heblaw chi neu’ch partner) sy’n berchen ar gyfran o’r eiddo?

source: Does anyone else own a share of the property?
cy: A oes unrhyw un arall sy’n berchen ar gyfran o’r eiddo?

source: Select ‘Yes’ if you share ownership with a friend, relative or ex-partner
cy: Rhowch ‘oes’ yn ateb os ydych chi’n rhannu perchenogaeth â ffrind, perthynas neu gynbartner

source: Tell us whether anyone else owns a share of this property
cy: Oes rhywun arall yn berchen ar gyfran o’r eiddo hwn

source: How much is the property worth?
cy: Beth yw gwerth yr eiddo?

source: Use a property website or the Land Registry house prices website.
cy: Defnyddiwch wefan eiddo neu wefan prisiau tai’r Gofrestrfa Tir

source: How much is left to pay on the mortgage?
cy: Pa swm sy’n weddill i’w dalu ar y morgais?

source: Include the full amount owed, even if the property has shared ownership, or enter 0 if you have no mortgage
cy: Rhowch y cyfanswm sy’n ddyledus, hyd yn oed os yw perchenogaeth yr eiddo wedi’i rhannu, neu rhowch 0 os nad oes gennych forgais

source: Tell us how much is left to pay on the mortgage
cy: Faint sy’n weddill i’w dalu ar y morgais

source: How much was your monthly mortgage repayment last month?
cy: Beth oedd swm eich ad-daliad misol ar y morgais ar gyfer y mis diwethaf?

source: Enter your mortgage repayment for last month
cy: Rhowch eich taliad morgais ar gyfer y mis diwethaf

source: Do you rent out any part of this property?
cy: Ydych chi’n gosod unrhyw ran o’r eiddo ar rent?

source: Tell us whether you rent out some of this property
cy: Ydych chi’n gosod rhan o’r eiddo hwn ar rent

source: If Yes, how much rent did you receive last month?
cy: Os ydych, beth oedd swm y rhent y cawsoch fis diwethaf?

source: Tell us how much rent you receive from this property
cy: Faint o rent rydych chi’n ei dderbyn ar gyfer yr eiddo hwn

source: Tell us how often you receive this rent
cy: Pa mor aml rydych chi’n derbyn y rhent hwn

source: Tell us how much rent you receive
cy: Faint o rent rydych chi’n ei dderbyn

source: Is your share of the property in dispute?
cy: A oes anghydfod ynghylch eich cyfran chi o’r eiddo?

source: For example, as part of the financial settlement of a divorce
cy: Er enghraifft, fel rhan o’r setliad ariannol mewn ysgariad

source: Tell us whether this property is in dispute
cy: Ydy’r eiddo hwn yn rhan o anghydfod

source: Your property
cy: Eich eiddo

source: You and your partner’s property
cy: Eich eiddo chi ac eiddo’ch partner

source: Check your answers and confirm
cy: Gwiriwch eich atebion a chadarnhewch

source: Your savings
cy: Eich cynilion

source: You and your partner’s savings
cy: Eich cynilion chi a’ch partner

source: Savings
cy: Cynilion

source: The total amount of savings in cash, bank or building society; or enter 0 if you have none
cy: Cyfanswm y cynilion mewn arian parod, yn y banc neu mewn cymdeithas adeiladu; neu rhowch 0 os nad oes gennych rai

source: Enter your total savings, or 0 if you have none
cy: Rhowch gyfanswm eich cynilion, neu 0 os nad oes gennych rai

source: Investments
cy: Buddsoddiadau

source: This includes stocks, shares, bonds (but not property); enter 0 if you have none
cy: Mae hyn yn cynnwys stociau, cyfrannau, bondiau (ond nid eiddo); rhowch 0 os nad oes gennych rai

source: Enter your total investments, or 0 if you have none
cy: Rhowch gyfanswm eich buddsoddiadau, neu 0 os nad oes gennych rai

source: Total value of items worth over £500 each
cy: Cyfanswm gwerth eitemau sy’n werth mwy na £500 yr un

source: See below for examples of what valuable items to include
cy: Gweler isod am enghreifftiau o’r eitemau gwerthfawr i’w cynnwys

source: Enter the total of all valuable items over £500
cy: Rhowch gyfanswm yr holl eitemau gwerthfawr dros £500

source: Enter 0 if you have no valuable items worth over £500 each
cy: Rhowch 0 os nad oes gennych eitemau gwerthfawr sy’n werth dros £500 yr un

source: Exit this page
cy: Gadael y dudalen hon

source: Staying safe online
cy: Cadw’n ddiogel ar-lein

source: Privacy Policy
cy: Polisi preifatrwydd

source: Cookies
cy: Cwcis

source: Contact
cy: Cysylltu

source: Accessibility statement
cy: Datganiad hygyrchedd

source: Sorry, you’re not likely to get legal aid
cy: Yn anffodus, dydych chi ddim yn debygol o gael cymorth cyfreithiol

source: If you cannot find your problem, it’s probably not covered by legal aid.
cy: Os na allwch ddod o hyd i’ch problem, mae’n debyg nad oes cymorth cyfreithiol ar gael ar ei chyfer.

source: Next steps to get help
cy: Camau nesaf i gael cymorth

source: Legal aid is available for this type of problem
cy: Mae cymorth cyfreithiol ar gael ar gyfer y math hwn o broblem

source: However, you may need to also qualify financially.
cy: Er hynny, mae'n bosib bod rhaid ymgymhwyso'n ariannol.

source: If you do qualify financially, you can speak to Civil Legal Advice (CLA), a national helpline for certain legal aid problems in England and Wales.
cy: Os ydych yn gymwys yn ariannol, gallwch siarad â Chyngor Cyfreithiol Sifil, sef llinell gymorth genedlaethol sy’n delio â phroblemau cymorth cyfreithiol penodol yng Nghymru a Lloegr.

source: The CLA operator will check all the information you’ve given through this service.
cy: Bydd y gweithredwr Cyngor Cyfreithiol Sifil yn gwirio’r holl wybodaeth rydych wedi’i rhoi drwy’r gwasanaeth hwn.

source: What you need to check if you qualify financially
cy: Yr hyn sydd angen i chi ei wirio i weld a ydych yn gymwys yn ariannol

source: You and your partner (if you have one) will need:
cy: Bydd angen y canlynol arnoch chi a’ch partner (os oes gennych un):

source: recent payslips (if you’re working) and bank statements
cy: slipiau cyflog diweddar (os ydych yn gweithio) a chyfriflenni banc

source: a summary of your income tax and National Insurance contributions
cy: crynodeb o’ch treth incwm a’ch cyfraniadau Yswiriant Gwladol

source: details of any savings and investments you have
cy: manylion unrhyw gynilon a buddsoddiadau sydd gennych

source: details of any benefits you receive
cy: manylion unrhyw fudd-daliadau rydych yn eu cael

source: mortgage statements and a current valuation for any property you own
cy: cyfriflenni morgais a phrisiad cyfredol ar gyfer unrhyw eiddo rydych yn berchen arno

source: When you do not need to complete the financial assessment
cy: Pan nad oes angen i chi gwblhau’r asesiad ariannol

source: under 18
cy: os ydych o dan 18 oed

source: have capital trapped in a property you own or other money or assets that you cannot access
cy: os oes gennych gyfalaf wedi’i ddal mewn eiddo rydych yn berchen arno, neu arian neu asedau eraill nad oes gennych fynediad atynt

source: If you use British Sign Language (BSL)
cy: Os ydych yn defnyddio Iaith Arwyddion Prydain (BSL)

source: You can choose not to complete the financial assessment online, and instead ask for a call with a BSL interpreter.
cy: Gallwch ddewis peidio â chwblhau’r asesiad ariannol ar-lein, a gofyn yn hytrach am alwad gyda dehonglydd BSL.

source: Check if you qualify financially
cy: Gwirio a ydych yn gymwys yn ariannol

source: Before you start
cy: Cyn ichi ddechrau

source: Alternatively, you can ask a legal aid adviser to take on your case.
cy: Neu, gallwch ofyn i gynghorydd cymorth cyfreithiol ymdrin â’ch achos.

source: Your adviser will check whether you qualify for legal aid at no cost to you by asking about your problem and your finances. If you qualify, in some cases you may need to pay a contribution towards your legal aid.
cy: Bydd eich cynghorydd yn gwirio a ydych yn gymwys i gael cymorth cyfreithiol yn ddi-dâl drwy ofyn cwestiynau i chi ynglŷn â’r mater dan sylw a’ch sefyllfa ariannol.

source: Find a legal adviser
cy: Dod o hyd i gynghorydd cyfreithiol

source: Other sources of help
cy: Ffynonellau cymorth eraill

source: You can also get advice from alternative help organisations for issues related to %(category_name)s. You don’t have to qualify for legal aid.
cy: Gallwch hefyd gael cyngor gan sefydliadau cymorth amgen ar gyfer materion sy’n ymwneud â %(category_name)s. Nid oes rhaid i chi fod yn gymwys i gael cymorth cyfreithiol.

source: To qualify for legal aid:
cy: I fod yn gymwys i gael cymorth cyfreithiol:

source: your income (or combined income if you have a partner) shouldn’t be more than £2,657 a month before tax
cy: rhaid i’ch incwm (neu incwm ar y cyd os oes partner gennych) fod yn ddim mwy na £2,657 y mis cyn talu treth

source: your savings (or combined savings if you have a partner) shouldn’t be more than £8,000
cy: rhaid i’ch cynilion (neu gynilion ar y cyd os oes partner gennych) fod yn ddim mwy na £8,000

source: These limits can vary in certain circumstances – for example, if you need advice about domestic abuse.
cy: Gall y cyfyngiadau hyn amrywio mewn rhai amgylchiadau - er enghraifft, os oes arnoch angen cyngor am gam-drin domestig

source: Find problems covered by legal aid
cy: Dod o hyd i broblemau y mae cymorth cyfreithiol yn delio â nhw

source: These are the problems covered by legal aid. Choose the problem you need help with.
cy: Dyma’r problemau y mae cymorth cyfreithiol yn delio â nhw. Dewiswch pa broblem y mae angen cymorth arnoch chi i ddelio ag o.

source: More problems covered by legal aid
cy: Mwy o broblemau y mae cymorth cyfreithiol yn delio â nhw

source: More problems
cy: Mwy o broblemau

source: housing
cy: tai

source: Find other free or low-cost legal help
cy: Dod o hyd i gymorth cyfreithiol arall fforddiadwy neu am ddim

source: free or affordable legal help (opens new tab).
cy: i gymorth cyfreithiol fforddiadwy neu am ddim (yn agor tab newydd).

source: The Citizen’s Advice website explains how to find
cy: Mae gwefan Cyngor ar Bopeth yn esbonio sut mae dod o hyd

source: Speak to an advice organisation
cy: Siarad â sefydliad cynghori

source: You can get free, independent advice from:
cy: Gallwch gael cymorth annibynnol am ddim gan y canlynol:

source: Citizen’s Advice (opens new tab)
cy: Cyngor ar Bopeth (yn agor tab newydd)

source: Advicelocal (opens new tab)
cy: Advicelocal (yn agor tab newydd)

source: exceptional case funding (opens new tab)
cy: gyllid ar gyfer achosion eithriadol (yn agor tab newydd)

source: Exceptional case funding
cy: Cyllid ar gyfer achosion eithriadol

source: In rare cases, you can still get government-funded legal help. Go to GOV.UK to find out about %(ecf_link)s.
cy: Mewn achosion prin, mae’n dal yn bosibl i chi gael cymorth cyfreithiol a ariennir gan y llywodraeth. Ewch i GOV.UK i gael gwybod am %(ecf_link)s.

source: Appeal a decision about your benefits
cy: Apelio yn erbyn penderfyniad am eich budd-daliadau

source: Legal aid only covers appeals to the:
cy: Dim ond apeliadau i’r canlynol y mae cymorth cyfreithiol yn eu cwmpasu:

source: For all other benefits appeals, go to GOV.UK and read <a href="https://www.gov.uk/appeal-benefit-decision" target="_blank">Appeal a benefits decision (opens in new tab)</a>.
cy: Ar gyfer pob apêl arall sy’n ymwneud â phenderfyniadau ynghylch budd-daliadau, ewch i GOV.UK a darllenwch <a href="https://www.gov.uk/apelio-penderfyniad-budd-dal" target="_blank">Apelio yn erbyn penderfyniad am eich budd-daliadau (yn agor mewn tab newydd)</a>.

source: If you cannot find your problem
cy: Os na allwch ddod o hyd i'ch problem

source: Exceptional cases
cy: Achosion eithriadol

source: In exceptional cases or if your case is going to a judicial review, legal aid may still be available.
cy: Mewn achosion arbennig, nes os bydd eich achos yn destun adolygiad barnwrol, gall cyngor cyfreithiol dal fod ar gael.

source: In exceptional cases, legal aid may still be available.
cy: Gall cymorth cyfreithiol dal fod ar gael mewn achosion eithriadol.

source: ask a legal adviser
cy: ofyn am gyngor gan gynghorydd

source: You can %(fala_link)s if an application might succeed in your case and how to apply.
cy: Gallwch %(fala_link)s cyfreithiol ynghylch a fydd cais am gymorth cyfreithiol yn debygol o lwyddo yn eich achos chi a sut i wneud cais.

source: apply directly
cy: gyflwyno cais yn uniongyrchol

source: You can also %(ecf_link)s to the Legal Aid Agency.
cy: Gallwch hefyd %(ecf_link)s i’r Asiantaeth Cymorth Cyfreithiol.

source: Show %(count)s more
cy: Dangos %(count)s mwy

source: Helpline
cy: Llinell Gymorth

source: Opening hours
cy: Oriau agor

source: Email
cy: E-bost

source: Legal action against public organisations
cy: Camau cyfreithiol yn erbyn sefydliadau cyhoeddus

source: Legal help to challenge something done by a public organisation. You might have been told you need to bring a ‘judicial review’.
cy: Cymorth cyfreithiol i herio rhywbeth a wneir gan sefydliad cyhoeddus. Efallai eich bod wedi cael gwybod bod angen i chi ddwyn ‘adolygiad barnwrol’.

source: This includes organisations like:
cy: Mae hyn yn cynnwys sefydliadau fel:

source: schools or other education settings
cy: ysgolion neu leoliadau addysg eraill

source: council, social services, local authority
cy: cyngor, gwasanaethau cymdeithasol, awdurdod lleol

source: NHS, hospitals
cy: y GIG, ysbytai

source: housing providers
cy: darparwyr tai

source: a government department or agency
cy: un o adrannau neu asiantaethau'r llywodraeth

source: foster carers, care homes, care facilities
cy: gofalwyr maeth, cartrefi gofal, cyfleusterau gofal

source: It also includes problems with the police, prisons or detention centres, for example if you’ve been:
cy: Mae hefyd yn cynnwys problemau gyda'r heddlu, carchardai neu ganolfannau cadw, er enghraifft os ydych chi wedi:

source: wrongfully arrested, stopped, held or detained anywhere
cy: cael eich arestio, eich stopio, eich dal neu eich cadw ar gam yn unrhyw le

source: physically, sexually or emotionally abused
cy: cael eich cam-drin yn gorfforol, yn rhywiol neu’n emosiynol

source: Back
cy: Yn ôl

source: Tell us what you think of this service (opens new tab)
cy: Rhowch eich barn am y gwasanaeth hwn (yn agor mewn tab newydd)

source: You can now call CLA on
cy: Gallwch ffonio <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn awr ar

source: Please quote your reference number when you call. Find out about <a class="govuk-link" href="https://www.gov.uk/call-charges" rel="external">call charges</a>.
cy: Dyfynnwch eich cyfeirnod pan fyddwch yn ffonio. <a href="https://www.gov.uk/costau-galwadau" rel="external">I gael rhagor o wybodaeth am gyfraddau galwadau</a>.

source: Print this page
cy: Argraffu’r dudalen hon

source: We will call you back
cy: Byddwn yn eich ffonio’n ôl

source: Your details have been submitted
cy: Cyflwynwyd eich manylion

source: Your reference number was sent to
cy: Anfonwyd eich cyfeirnod i

source: If you have a court hearing date it is important that you get advice as soon as possible. You may be able to get last-minute help on the day of the hearing from an adviser in the court building.
cy: Os oes gennych ddyddiad gwrandawiad llys, mae’n bwysig eich bod yn cael cyngor cyn gynted â phosib. Efallai y cewch gymorth ar fyr rybudd ar ddiwrnod y gwrandawiad gan gynghorydd yn adeilad y llys.

source: What happens next?
cy: Beth sy’n di?

source: Your details have been submitted and an operator will call the person you nominated at least once during your chosen time, or as close to the time as possible
cy: Mae eich manylion wedi cael eu cyflwyno a bydd gweithredwr yn eich ffonio o leiaf unwaith ar yr adeg o’ch dewis, neu mor agos at yr adeg honno ag sy’n bosibl

source: Your details have been submitted and an operator will call you at least once during your chosen time, or as close to the time as possible
cy: Mae eich manylion wedi cael eu cyflwyno a bydd gweithredwr yn eich ffonio o leiaf unwaith ar yr adeg o’ch dewis, neu mor agos at yr adeg honno ag sy’n bosibl

source: When a CLA operator calls, the call will come from an anonymous number.
cy: Pan fydd gweithredwr <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn eich ffonio, bydd rhif anhysbys yn ymddangos ar yr alwad.

source: If you need to urgently protect yourself or your family you should try and get advice as soon as possible.
cy: Os oes arnoch angen diogelu chi’ch hun neu eich teulu ar frys, dylech geisio cael cymorth cyn gynted â phosib

source: The first person they speak to will be an operator who will ask about your problem and your financial circumstances.
cy: Yr unigolyn cyntaf fydd yn siarad â hwy fydd gweithredwr a fydd yn gofyn cwestiynau am eich problem a’ch amgylchiadau ariannol

source: The first person you speak to will be an operator who will ask about your problem and your financial circumstances.
cy: Yr unigolyn cyntaf fydd yn siarad â chi fydd gweithredwr a fydd yn gofyn cwestiynau i chi am eich problem a’ch amgylchiadau ariannol.

source: If it looks like you might qualify for legal aid they’ll be put through to a specialist adviser, who will make the final decision on your case.
cy: Os yw’n ymddangos y gallech chi fod yn gymwys am gymorth cyfreithiol, fe’ch trosglwyddir i un o gynghorwyr arbenigol a fydd yn gwneud y penderfyniad terfynol ynghylch eich achos.

source: If it looks like you might qualify for legal aid you’ll be put through to a specialist adviser, who will make the final decision on your case.
cy: Os yw’n ymddangos y gallech chi fod yn gymwys am gymorth cyfreithiol, fe’ch trosglwyddir i un o gynghorwyr arbenigol a fydd yn gwneud y penderfyniad terfynol ynghylch eich achos.

source: Please be aware that the specialist adviser will need evidence of the domestic violence before they can make a decision on your case.
cy: Byddwch yn ymwybodol fod y cynghorydd arbenigol angen tystiolaeth o’r trais domestig cyn y gallant wneud penderfyniad ar eich achos.

source: Find out what you can use as evidence
cy: Canfod beth allwch ei ddefnyddio fel tystiolaeth

source: If your case involves domestic abuse or violence, the specialist adviser will need evidence of this before they can make a decision on your case.
cy: Os yw eich cais yn ymwneud â cham-drin neu drais domestig, bydd y cynghorydd arbenigol angen tystiolaeth o hyn cyn gwneud penderfyniad ynghylch eich achos.

source: You will also need to provide evidence of your financial circumstances. Your specialist adviser will explain what is needed.
cy: Bydd angen i chi ddarparu tystiolaeth o’ch amgylchiadau ariannol hefyd. Bydd eich cynghorydd arbenigol yn egluro beth sydd ei angen.

source: You will need to provide evidence of your financial circumstances and maybe your problem. Your specialist adviser will explain what is needed.
cy: Bydd angen i chi ddarparu tystiolaeth o’ch amgylchiadau ariannol ac efallai eich problem. Bydd eich cynghorydd arbenigol yn esbonio beth fyddwch ei angen.

source: If your specialist adviser thinks you need to speak to someone in person or have someone represent you in court, they will organise this.
cy: Os bydd eich cynghorydd arbenigol yn penderfynu bod angen i chi siarad â rhywun eich hun neu os bydd arnoch angen rhywun i’ch cynrychioli yn y llys, fe fydd yn trefnu hyn.

source: If CLA can’t help you, we’ll always suggest where else you might get help.
cy: Os nad yw <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn gallu eich helpu, byddwn ni bob amser yn awgrymu rhywle arall allai’ch helpu.

source: If we can do anything to make it easier for you to communicate with us, please tell the operator.
cy: Os gallwn wneud unrhyw beth i’w gwneud hi’n haws i chi gyfathrebu gyda ni, dywedwch wrth y gweithredwr.
