Repository: ministryofjustice/laa-access-civil-legal-aid
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: The <abbr title="Civil Legal Advice">CLA</abbr> Operator Service is delivered by Hinduja Global Solutions UK Ltd, a contractor employed by the Legal Aid Agency to deliver <abbr title="Civil Legal Advice">CLA</abbr>. If it is determined that you qualify for <abbr title="Civil Legal Advice">CLA</abbr>, we may put you through to one of a number of <abbr title="Civil Legal Advice">CLA</abbr> Specialist Advice Providers. These organisations are data processors on behalf of the Legal Aid Agency and Ministry of Justice.
cy: Darperir Gwasanaeth Gweithredwr CCS gan Hinduja Global Solutions UK Cyf, contractwr a ddefnyddir gan yr Asiantaeth Cymorth Cyfreithiol i ddarparu CCS. Pe penderfynid gennym eich bod yn gymwys ar gyfer CCS, efallai y trosglwyddwn ni ohonoch at un o’r amryw Ddarparwyr Cyngor Arbenigol CCS. Mae’r cyrff hyn yn broseswyr data ar gyfer yr Asiantaeth Cymorth Cyfreithiol a’r Weinyddiaeth Gyfiawnder.

source: About personal information
cy: Ynglŷn â gwybodaeth bersonol

source: Personal data is information about you as an individual. It can be your name, address or telephone number.
cy: Data personol ydy gwybodaeth amdanoch chi fel unigolyn. Gall hynny fod yn enw, cyfeiriad neu rif ffôn.

source: The kind of information that <abbr title="Civil Legal Advice">CLA</abbr> will collect about you includes:
cy: Mae’r fath o wybodaeth fydd CCS yn casglu amdanoch chi yn cynnwys:

source: Personal details including your name, address, date of birth, contact details, diversity monitoring information and national insurance number;
cy: Manylion personol yn cynnwys eich enw, cyfeiriad, dyddiad geni, manylion cyswllt, gwybodaeth fonitro amrywiaeth a rhif yswiriant gwladol;

source: Financial information needed to determine if you qualify for legal aid;
cy: Manylion cyllidol sydd angen er mwyn penderfynu os ydych yn gymwys ar gyfer cymorth cyfreithiol;

source: Reason for contacting <abbr title="Civil Legal Advice">CLA</abbr>, such as the nature of your problem or specific details about your situation;
cy: Rheswm dros cysylltu â CCS, megis hanfodion eich problem neu fanylion penodol ynglŷn â’ch sefyllfa;

source: Details of any specific needs that you may have in order to access the <abbr title="Civil Legal Advice">CLA</abbr> service;
cy: Manylion unrhyw anghenion penodol sydd gennych chi er mwyn cael mynediad at wasanaeth CCS;

source: Responses to any customer satisfaction survey or details of any feedback, complaints or requests for a review of our decision about whether you qualify for legal aid.
cy: Ymatebion i unrhyw arolwg boddhad cwsmer neu fanylion unrhyw adborth, cwynion neu geisiadau am adolygiad o’n penderfyniad ynglŷn a’ch cymhwyster am gyfer cymorth cyfreithiol.

source: We will only save the information you enter if you decide to contact a Civil Legal Advice operator. Therefore, the personal information that you have submitted, will only be stored when you click ‘submit your application’.
cy: Cadwn ni ddim ond o’r gwybodaeth y rhoddwch chi os ydych chi’n penderfynu i gysylltu â gweithredwr Cyngor Cyfreithiol Sifil. Felly, bydd y wybodaeth bersonol yr ydych chi wedi cyflwyno ddim ond yn cael e chadw ar ôl i chi glicio ‘danfon cais’.

source: We know how important it is to protect customers’ privacy and to comply with data protection laws. We will safeguard your personal data and will only disclose it where it is lawful to do so, or with your consent.
cy: Rydyn yn ystyried pa mor bwysig ydy hi i ddiogelu preifatrwydd cwsmeriaid a chydymffurfio â chyfraith diogelu data. Byddwn ni’n gwarchod eich data personol a dim ond ei ddatgelu lle mae’n gyfreithlon i’w wneud, neu gyda’ch caniatâd.

source: Types of personal data we process
cy: Mathau o ddata personol yr ydym yn prosesu

source: We only process personal data that is relevant for the services we are providing to you. The personal data which you have provided will only be used for the purposes set out below.
cy: Rydym ond yn prosesu data personol sy’n berthnasol ar gyfer y gwasanaethau yr ydym ni’n darparu i chi. Ddefnyddir y data personol yr ydych chi wedi cyflwyno ar gyfer y dibenion isod yn unig.

source: Purpose of processing and the lawful basis for the process
cy: Diben prosesu a sail gyfreithiol y proses

source: The purpose of the Legal Aid Agency collecting and processing the personal data which you have provided in a legal aid application is for the purposes of providing legal aid. Our lawful basis is ‘the performance of a task carried out in the public interest or in the exercise of official authority’ as set out in Article 6(1)(e) of UK GDPR. The tasks are those set out in the Legal Aid, Sentencing and Punishment of Offenders Act 2012. Specifically, we will use this personal data in the following ways:
cy: Darparu cymorth cyfreithiol ydy diben yr Asiantaeth Cymorth Cyfreithiol wrth gasglu a phrosesu’r data personol yr ydych chi wedi cyflwyno mewn cais cymorth cyfreithiol. Ein sail gyfreithiol ydy ‘perfformio tasg a chynhelir er budd y cyhoedd neu wrth arfer awdurdod swyddogol’ yn ôl Erthygl 6(1)(e) GDPR y DU. Y tasgau ydy’r rhai a rhestrir yn Neddf Gymorth Cyfreithiol, Dedfryd a Chosbi Troseddwyr 2012. Yn benodol, byddwn yn defnyddio’r data personol hwn fel a ganlyn:

source: In deciding whether you qualify for legal aid. This is to assess whether your issue is within the scope of the <abbr title="Civil Legal Advice">CLA</abbr> and whether you are financially eligible.
cy: Er mwyn penderfynu os ydych yn gymwys ar gyfer cymorth cyfreithiol. Hynny yw, asesu os ydy’ch fater o fewn terfynau CCS ac os ydych chi’n gymwys yn ariannol.

source: In assisting us in providing information and/or advice services to you.
cy: Er mwyn helpu ni darparu gwybodaeth a/neu gwasanaethau cyngor i chi.

source: To prevent or detect crime and fraud.
cy: Er mwyn atal neu ganfod trosedd neu dwyll.

source: In conducting periodic assurance audits on legal aid files to ensure that decisions have been made correctly and accurately.
cy: Er mwyn cynnal archwiliadau aswiriant ar ffeiliau cymorth cyfreithiol i sicrhau bod penderfyniadau wedi eu gwneud yn gywir ac yn iawn.

source: In producing statistics and information on our processes to enable us to improve and monitor our processes to assist us in carrying out our functions. This information is collated in an anonymous format, it will not be used to identify you.
cy: Er mwyn cynhyrchu ystadegau a gwybodaeth ynglŷn â’n prosesau, yn ein galluogi ni i wella a monitro prosesau er mwyn helpu cynnal ein swyddogaethau. Coladir y wybodaeth hon mewn fformat dienw, ac ni ddefnyddir y wybodaeth i’ch adnabod chi.

source: Were the Legal Aid Agency unable to collect this personal information, we would not be able to conduct the activities above, which would prevent us from providing legal aid.
cy: Ble na all yr Asiantaeth Cymorth Cyfreithiol casglu’r wybodaeth bersonol hon, na allwn cynnal y gweithgareddau uchod, a byddai’n ein hatal ni rhag ddarparu cymorth cyfreithiol.

source: We collect ‘special categories of personal data’. This data is collected where necessary for the purposes set out above. The condition under which we process this data is Article 9(g) of UK GDPR – Reasons of substantial public interest. Our associated Schedule 1 condition is Statutory and Government purposes. We also collect this data for the purposes of monitoring equality, this is a legal requirement for public authorities under the Equality Act 2010. Special categories of personal data will be treated with the strictest confidence and any information published under the Equality Act will not identify you or anyone else associated with your legal aid application.
cy: Rydym ni’n casglu ‘categorïau arbennig o ddata personol’. Cesglid y data hwn lle mae angen at y dibenion a ddatgenir uchod. Rydym ni’n prosesu’r data hwn o dan amod Erthygl 9(g) GDPR y DU – Rhesymau o fudd sylweddol i’r cyhoedd. Ein hamod cysylltiedig Atodlen 1 ydy Dibenion Statudol a Llywodraethol. Rydyn ni hefyd yn casglu’r data hwn ar gyfer diben monitro cydraddoldeb; mae hyn yn ofyniad cyfreithiol ar gyfer awdurdodau cyhoeddus o dan Ddeddf Gydraddoldeb 2010. Ymdriniwn â chategorïau arbennig o ddata personol gyda’r cyfrinachedd eithaf ac na fydd unrhyw wybodaeth a gyflwynir o dan y Ddeddf Gydraddoldeb yn eich enwi chi neu unrhyw berson arall sy’n gysylltiedig â’ch cais cymorth cyfreithiol.

source: We collect ‘personal data relating to criminal convictions and offences or related security measures’. This data is collected where relevant for the purposes set out above. The Legal Aid Agency is an Executive Agency of the <abbr>MoJ</abbr>, an Official Authority for the purposes of Article 10 of UK GDPR.
cy: Rydym yn casglu ‘data personol ynglŷn ag euogfarnau a throseddau neu fesurau diogelwch cysylltiedig’. Cesglir y data hwn lle mae’n berthnasol ar gyfer y dibenion a ddatgenir uchod. Mae’r Asiantaeth Cymorth Cyfreithiol yn Asiantaeth Gweithredol y Weinyddiaeth Gyfiawnder, sef Awdurdod Swyddogol ar gyfer dibenion Erthygl 10 GDPR y DU.

source: Who the information may be shared with
cy: Gyda phwy y gellid rhannu’r gwybodaeth

source: We sometimes need to share the personal information we process with other organisations. When this is necessary, we will comply with all aspects of the relevant data protection laws. The organisations we may share your personal information include:
cy: Weithiau mae angen i ni rannu'r wybodaeth bersonol rydyn ni’n ei phrosesu gyda chyrff eraill. Pan fydd hyn yn angenrheidiol, byddwn ni’n cydymffurfio â phob agwedd y deddfau diogelu data perthnasol. Mae’r cyrff y gallwn ni rannu eich gwybodaeth bersonol gyda nhw yn cynnwys:

source: Public authorities such as: HM Courts and Tribunal Service (<abbr>HMCTS</abbr>), HM Revenue and Customs (<abbr>HMRC</abbr>), Department of Work and Pensions (<abbr>DWP</abbr>) and HM Land Registry;
cy: Awdurdodau cyhoeddus fel: Gwasanaeth Llysoedd a Thribiwnlysoedd EM (GLlThEM), Cyllid a Thollau EM (CThEM), yr Adran Gwaith a Phensiynau (AGPh) a Chofrestrfa Tir EM;

source: Non-public authorities such as: Credit reference agencies Equifax and Transunion and our debt collection partners Advantis Credit Ltd;
cy: Awdurdodau nad ydynt yn gyhoeddus megis: Asiantaethau gwirio credyd Equifax a Transunion a'n partneriaid casglu dyledion Advantis Credit Ltd;

source: Hinduja Global Solutions UK Ltd and
cy: Hinduja Global Solutions UK Cyf a

source: If false or inaccurate information is provided or fraud identified, the Legal Aid Agency can lawfully share your personal information with fraud prevention agencies to detect and to prevent fraud and money laundering.
cy: Os darperir gwybodaeth ffug neu anghywir neu os canfyddir twyll, gall yr Asiantaeth Cymorth Cyfreithiol rannu eich gwybodaeth bersonol yn gyfreithlon gydag asiantaethau atal twyll i ddarganfod ac atal twyll a gwyngalchu arian.

source: Where a debt is owed to the Legal Aid Agency, we may share your data with public authorities such as HMRC and DWP and with debt collection partners such as Advantis Credit Ltd for the purposes of tracing, debt collection and enforcement.
cy: Lle mae dyled tuag at yr Asiantaeth Cymorth Cyfreithiol, mae’n bosibl y byddwn ni’n rhannu eich data gydag awdurdodau cyhoeddus fel CThEM a’r AGPh a phartneriaid casglu dyledion fel Advantis Credit Ltd at ddibenion olrhain, casglu dyledion a gorfodi.

source: You can contact our Data Protection Officer for further information on the organisations we may share your personal information with.
cy: Gallwch chi gysylltu â’n Swyddog Diogelu Data i gael rhagor o wybodaeth am y sefydliadau y gallwn ni rannu eich gwybodaeth bersonol gyda nhw.

source: Data processors
cy: Prosesyddion data

source: We may contract with third party data processors to provide email, system administration, document management and IT storage services. Any personal data shared with a data processor for this purpose will be governed by model contract clauses under data protection law.
cy: Mae’n bosibl y byddwn ni’n contractio gyda phrosesyddion data trydydd parti i ddarparu gwasanaethau e-bost, gweinyddu systemau, rheoli dogfennau a storio TG. Bydd unrhyw ddata personol a rennir gyda phrosesydd data at y diben hwn yn cael ei lywodraethu gan gymalau contract enghreifftiol o dan gyfraith diogelu data.

source: We contract with Advantis Credit Ltd as a data processor for the collection and enforcement of criminal legal aid contributions. Any personal data shared with the data processor for this purpose is governed by model contract clauses under data protection law.
cy: Rydym yn contractio â Advantis Credit Ltd fel prosesydd data ar gyfer casglu a gorfodi cyfraniadau cymorth cyfreithiol troseddol. Mae unrhyw ddata personol a rennir gyda’r prosesydd data at y diben hwn yn cael ei lywodraethu gan gymalau contract enghreifftiol o dan gyfraith ddiogelu data.

source: Automated decision making
cy: Gwneud penderfyniadau yn awtomataidd

source: We do not use solely automated decision making within the definition of Article 22(1) of UK <abbr>GDPR</abbr>. The overall decision on an application for legal aid or a claim for costs in a legal aid case will always be made by a human decision maker. This could be a member of our staff, or a staff member of a legal aid Provider acting under delegated authority from the Legal Aid Agency.
cy: Nid ydym yn defnyddio prosesau gwneud penderfyniadau yn awtomataidd yn unig o fewn y diffiniad yn Erthygl 22(1) GDPR y DU. Bydd y penderfyniad cyflawn ar gais am gymorth cyfreithiol neu hawliad am gostau mewn achos cymorth cyfreithiol yn cael ei wneud gan fod dynol bob tro. Gallai hwn fod yn aelod o’n staff, neu’n aelod o staff Darparwr cymorth cyfreithiol sy’n gweithredu o dan awdurdod dirprwyedig yr Asiantaeth Cymorth Cyfreithiol.

source: Details of transfers to third country and safeguards
cy: Manylion trosglwyddiadau i drydydd gwledydd ac amddiffyniadau

source: Personal data may be transferred to locations in the European Economic Area (<abbr>EEA</abbr>) where required by our data processors for hosting, storage and secure backup of our IT services. Such transfers are made on the basis of Adequacy decisions between the UK and EEA in accordance with Article 45 of UK <abbr>GDPR</abbr>.
cy: Mae’n bosibl y drosglwyddir data personol i leoliadau yn yr Ardal Economaidd Ewropeaidd (AEE) lle bod angen ar ein prosesyddion data ar gyfer lletya, storio a chadw copïau wrth gefn diogel o’n gwasanaethau TG. Gwneir trosglwyddiadau cyfryw ar sail penderfyniadau Digonolrwydd rhwng y DU a’r AEE yn unol ag Erthygl 45 GDPR y DU.

source: In limited and exceptional circumstances, where required for the provision of technical support, personal data stored in our call centre software may be accessed by support staff located in USA, Romania, Philippines, Singapore or Australia. Where transfers for this purpose are made to locations without Adequacy decisions the transfer is made on the basis of exceptions under Article 49 of UK <abbr>GDPR</abbr> and is required for the legitimate interests of the Ministry of Justice. The software provider maintains the same standards of IT and personnel security for its services overseas as it does for services in the UK.
cy: Mewn amgylchiadau cyfyngedig ac eithriadol, lle mae angen ar gyfer darparu cymorth technegol, gall staff cymorth yn yr UDA, Rwmania, y Philipinau, Singapôr neu Awstralia gael mynediad i ddata personol sydd wedi'i storio yn ein meddalwedd canolfan alwadau. Lle gwneir trosglwyddiadau at y diben hwn i leoliadau heb benderfyniadau Digonolrwydd, gwneir y trosglwyddiad ar sail eithriadau o dan Erthygl 49 GDPR y DU lle mae angen er budd cyfreithus y Weinyddiaeth Gyfiawnder. Mae darparwr y meddalwedd yn cynnal yr union safonau TG a diogelwch personél ar gyfer ei wasanaethau dramor ag y mae o ar gyfer gwasanaethau yn y DU.

source: Retention period for information collected
cy: Cyfnod cadw ar gyfer gwybodaeth a gesglir

source: Your personal information will not be retained for any longer than is necessary for the lawful purposes for which it has been collected and processed. This is to ensure that your personal information does not become inaccurate, out of date or irrelevant. The Legal Aid Agency have set retention periods for the personal information that we collect, this can be accessed via our website:
cy: Ni chaiff eich gwybodaeth bersonol ei chadw am fwy o amser na sy’n angenrheidiol at y dibenion cyfreithlon y gasglwyd a phroseswyd ar eu cyfer. Mae hyn er mwyn sicrhau nad ydy eich gwybodaeth bersonol yn mynd yn wallus, yn heneiddol nac yn amherthnasol. Mae’r Asiantaeth Cymorth Cyfreithiol wedi gosod cyfnodau cadw ar gyfer y wybodaeth bersonol a gasglwn, a gellir gael mynediad i hyn trwy ein gwefan ni:

source: You can also contact our Data Protection Officer for a copy of our retention schedules.
cy: Gallwch hefyd gysylltu â'n Swyddog Diogelu Data i gael copi o'n hamserlenni cadw.

source: While we retain your personal data, we will ensure that it is protected from loss, misuse or unauthorised access and disclosure. Once the retention period has been reached, your personal data will be permanently and securely deleted and destroyed.
cy: Tra byddwn ni’n cadw eich data personol, byddwn yn sicrhau ei fod yn cael ei ddiogelu rhag golled, camddefnydd neu fynediad a datgeliad anawdurdodedig. Unwaith y bydd y cyfnod cadw yn dod i ben, bydd eich data personol yn cael ei ddileu a'i ddinistrio'n barhaol ac yn ddiogel.

source: Access to personal information
cy: Mynediad i wybodaeth bersonol

source: You can find out if we hold any personal data about you by making a ‘subject access request’. If you wish to make a subject access request please contact:
cy: Gallwch ddarganfod os ydym yn cadw unrhyw ddata personol amdanoch trwy wneud ‘cais cyrchu gwrthrych’. Os hoffech chi wneud cais cyrchu gwrthrych, cysylltwch â:

source: When we ask you for personal data
cy: Tra gofynnwn ni am wybodaeth bersonol

source: We promise to inform you why we need your personal data and ask only for the personal data we need and not collect information that is irrelevant or excessive.
cy: Rydyn ni’n addo i roi gwybod i chi pam mae angen eich data personol chi, dim ond i ofyn am y data personol rydyn ni ei angen, ac i beidio casglu gwybodaeth sy’n amherthnasol neu’n ormodol.

source: When we collect your personal data, we have responsibilities, and you have rights. These include:
cy: Pan yr ydyn ni’n casglu eich data personol, mae gennym ni gyfrifoldebau, a mae gennych chi hawliau, gan gynnwys:

source: That you can withdraw consent at any time, where relevant;
cy: Eich bod chi’n gallu tynnu caniatâd yn ôl ar unrhyw adeg, lle mae’n berthnasol;

source: That you can lodge a complaint with the supervisory authority;
cy: Eich bod chi’n gallu gwneud cwyn i’r awdurdod goruchwylio;

source: That we will protect and ensure that no unauthorised person has access to it;
cy: Ein bod ni’n diogelu’r data ac yn sicrhau nad ydy unrhyw berson anawdurdodedig yn cael mynediad iddo;

source: That your personal data is shared with other organisations only for legitimate purposes;
cy: Y rennir eich data personol gyda chyrff eraill at ddibenion cyfreithus yn unig;

source: That we don’t keep it longer than is necessary;
cy: Ein bod ni ddim yn ei gadw yn hirach na sy’n angenrheidiol;

source: That we will not make your personal data available for commercial use without your consent; and
cy: Ein bod ni ddim yn gwneud eich data personol ar gael ar gyfer defnyddion masnachol heb eich caniatâd; ac

source: That we will consider your request to correct, stop processing or erase your personal data.
cy: Ein bod ni’n ystyried unrhyw gais i gywiro, atal prosesu neu ddileu eich data personol.

source: You can get more details on:
cy: Gallwch chi gael mwy o fanylion ynglŷn â:

source: Agreements we have with other organisations for sharing information;
cy: Cytundebau sydd gennym ni gyda chyrff eraill er mwyn rhannu gwybodaeth;

source: Circumstances where we can pass on personal information without telling you, for example, to help with the prevention or detection of crime or to produce anonymised statistics;
cy: Amgylchiadau lle gallwn ni rhannu gwybodaeth bersonol heb ddweud wrthoch chi, er enghraifft, i helpu gyda rhwystro neu ganfod troseddau neu i greu ystadegau dienw;

source: Our instructions to staff on how to collect, use or delete your personal information;
cy: Ein cyfarwyddiadau i’n staff ni ynglŷn â sut i gasglu, defnyddio neu ddileu eich gwybodaeth bersonol;

source: How we check that the information we hold is accurate and up-to-date;
cy: Sut yr ydyn ni’n sicrhau bod y gwybodaeth yr ydyn ni’n ei chadw yn gywir ac yn gyfoes;

source: How to make a complaint.
cy: Sut i wneud cwyn.

source: For more information about the above issues, please contact the <abbr>MoJ</abbr> Data Protection Officer:
cy: Am fwy o wybodaeth ynglŷn â’r materion uchod, cysylltwch â swyddog diogelu data y Weinyddiaeth Gyfiawnder:

source: The Data Protection Officer<br/>Ministry of Justice<br/>102 Petty France<br/>London<br/>SW1H 9AJ<br/>
cy: Y Swyddog Diogelu Data<br/>Gweinyddiaeth Gyfiawnder<br/>102 Petty France<br/>Llundain<br/>SW1H 9AJ<br/>

source: For more information on how and why your information is processed, please see the information provided when you accessed our services or were contacted by us.
cy: Am fwy o wybodaeth ynglŷn â sut a pam yr ydyn ni’n prosesu eich gwybodaeth, gweler y wybodaeth a ddarparwyd pan ddechreuoch chi ddefnyddio ein gwasanaethau neu pan gysylltom ni â chi.

source: Complaints
cy: Cwynion

source: When we ask you for information, we will keep to the law. If you consider that your information has been handled incorrectly, you can contact the Information Commissioner for independent advice about data protection. You can contact the Information Commissioner at:
cy: Pan yr ydym yn gofyn i chi am wybodaeth, byddwn yn cadw at y gyfraith. Os ydych yn ystyried bod eich gwybodaeth wedi cael ei thrin yn anghywir, gallwch gysylltu â’r Comisiynydd Gwybodaeth ar gyfer cyngor annibynnol ynglŷn â diogelu data. Gallwch gysylltu â’r Comisiynydd Gwybodaeth ar:

source: Information Commissioner’s Office<br />
cy: Swyddfa’r Comisiynydd Gwybodaeth<br />

source: Tel:
cy: Ffôn:

source: You’ve reached the end of this service
cy: Rydych wedi cyrraedd diwedd y gwasanaeth hwn

source: For your security, the information you’ve entered has automatically been deleted.
cy: Er eich diogelwch chi, mae’r wybodaeth a fewnbynnwyd gennych yn cael ei dileu’n awtomatig.

source: You can start again below.
cy: Gallwch ddechrau eto isod.

source: Start again
cy: Dechrau eto

source: You might qualify for free legal advice
cy: Efallai byddwch yn gymwys am gyngor cyfreithiol am ddim

source: You might be able to get free legal advice through the Housing Loss Prevention Advice Scheme.
cy: Efallai byddwch yn gallu cael cyngor cyfreithiol am ddim trwy’r Cynllun Cyngor Atal Colli Tai.

source: This advice is free to anyone who can show their home is at risk. It does not depend on what you earn or your financial situation.
cy: Mae’r cyngor am ddim i unrhyw un sy’n gallu dangos fod eu tŷ mewn perygl. Dydy hi ddim yn dibynnu ar faint rydych yn ennill neu eich sefyllfa ariannol.

source: Next steps
cy: Camau nesaf

source: We’ll show you a list of legal advisors.
cy: Byddwn yn dangos rhestr o gynghorwyr cyfreithiol i chi.

source: You need to contact the legal adviser.
cy: Bydd yn rhaid i chi gysylltu â'r cynghorydd cyfreithiol.

source: Explain that you could lose your home.
cy: Eglurwch fod yna risg y byddwch yn colli eich cartref.

source: Tell them if you have any letters or documents about your situation.
cy: Dywedwch wrthynt os oes gennych unrhyw lythyrau neu ddogfennau yn ymwneud â'ch sefyllfa.
