Repository: ministryofjustice/laa-access-civil-legal-aid
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Select why you were discriminated against, or select ‘None of these’
cy: Dewiswch pam y gwahaniaethwyd yn eich erbyn, neu dewiswch ‘Dim un o’r rhain’.

source: Race, colour, ethnicity, nationality
cy: Hil, lliw, ethnigrwydd, cenedligrwydd

source: Sex (male or female)
cy: Rhyw (gwryw neu fenyw)

source: Disability, health condition, mental health condition
cy: Anabledd, cyflwr iechyd, cyflwr iechyd meddwl

source: Religion, belief, lack of religion
cy: Crefydd, cred, diffyg crefydd

source: Age
cy: Oedran

source: Pregnancy or being a mother
cy: Beichiogrwydd neu bod yn fam

source: Sexual orientation - gay, bisexual, other sexuality
cy: Cyfeiriadedd rhywiol – hoyw, deurywiol, rhywioldeb arall

source: Gender reassignment, being transgender, non-binary or gender-fluid
cy: Ailbennu rhywedd, bod yn drawsryweddol, yn anneuaidd neu’n rhyweddhylifol

source: Married status - being married, in a civil partnership
cy: Statws priodasol – wedi priodi, mewn partneriaeth sifil

source: Is this to do with police, prisons or detention centres?
cy: A yw hyn yn ymwneud â’r heddlu, carchardai neu ganolfannau cadw?

source: Select if this is about the police, prisons or detention centres
cy: Dewiswch a yw hyn yn ymwneud â’r heddlu, carchardai neu ganolfannau cadw

source: Are you under 18?
cy: Ydych chi dan 18 oed?

source: Select if you’re under 18
cy: Dewiswch os ydych chi dan 18 oed

source: Were you accused by a landlord or the council?
cy: A gawsoch chi eich cyhuddo gan landlord neu'r cyngor?

source: Select ‘Yes’ if you were accused by a landlord or the council
cy: Dewiswch ‘Ydw’ os cawsoch eich cyhuddo gan landlord neu’r cyngor

source: I will call you
cy: Byddaf yn galw chi

source: Call me back
cy: Eich ffonio’n ôl

source: Call someone else instead of me
cy: Ffoniwch rywun arall yn fy lle

source: -- Please select --
cy: -- Dewiswch --

source: Why do you want to contact Civil Legal Advice?
cy: Pam eich bod eisiau cysylltu â’r gwasanaeth Cyngor Cyfreithiol Sifil?

source: Select all that apply
cy: Dewiswch bob un a fyddai yn wir

source: I don’t know how to answer a question
cy: Dydw i ddim yn gwybod sut i ateb cwestiwn

source: I don’t have the paperwork I need
cy: Does gen i ddim y gwaith papur rwyf ei angen

source: I’d prefer to speak to someone
cy: Byddai’n well gennyf siarad â rhywun

source: I have trouble using online services
cy: Rwy’n cael trafferth defnyddio gwasanaethau ar-lein

source: I don’t understand how this service can help me
cy: Dydw i ddim yn deall sut gall y gwasanaeth hwn fy helpu

source: My problem area isn’t covered
cy: Nid yw’n ymdrin â maes fy mhroblem

source: I’d prefer not to say
cy: Mae’n well gen i beidio â dweud

source: Another reason
cy: Rheswm arall

source: Continue to contact CLA
cy: Parhau i gysylltu â CLA

source: Contact Civil Legal Advice
cy: Cyngor Cyfreithiol Sifil

source: Your full name
cy: Eich enw llawn

source: Your full name must be 400 characters or less
cy: Rhaid i’ch enw llawn fod yn 400 nod neu lai

source: Tell us your name
cy: Dywedwch wrthym beth yw eich enw

source: Select a contact option
cy: Dewiswch opsiwn ar gyfer cysylltu

source: Tell us how we should get in contact
cy: Dywedwch wrthym sut dylem gysylltu

source: Phone number
cy: Rhif ffôn

source: Enter the full number, including the area code. For example, 01632 960 1111.
cy: Rhowch y rhif cyfan, gan gynnwys côd yr ardal. Er enghraifft, 01632 960 1111.

source: Tell us what number to ring
cy: Dywedwch wrthym pa rif i’w ffonio

source: Your telephone number must be 20 characters or less
cy: Rhaid i’ch rhif ffôn fod yn 20 llythyren neu lai

source: Select a time for us to call
cy: Dewiswch amser i ni eich ffonio

source: Call today
cy: Ffoniwch heddiw

source: Call on another day
cy: Ffoniwch ar ddiwrnod arall

source: Time
cy: Amser

source: Day
cy: Dydd

source: No - do not say where you are calling from
cy: Na allwch – peidiwch â dweud o le rydych chi’n galw.

source: Full name of the person to call
cy: Enw llawn yr unigolion i’w ffonio

source: Their full name must be 400 characters or less
cy: Rhaid i’w enw llawn fod yn 400 nod neu lai

source: Tell us the name of the person to call
cy: Dywedwch wrthym beth yw enw’r unigolyn y dylem ei ffonio

source: Relationship to you
cy: Ei gysylltiad/chysylltiad â chi

source: Tell us how you know this person
cy: Dywedwch wrthym sut rydych chi’n adnabod yr unigolyn hwn

source: Email (optional)
cy: E-bost (dewisol)

source: We will use this to send your reference number.
cy: Byddwn yn defnyddio hwn i anfon eich cyfeirnod i chi.

source: Your address must be 255 characters or less
cy: Rhaid i’ch cyfeiriad fod yn 255 nod neu lai

source: Invalid email address
cy: Cyfeiriad e-bost annilys

source: Postcode (optional)
cy: Côd post (dewisol)

source: Select an address
cy: Dewiswch gyfeiriad

source: Street address (optional)
cy: Cyfeiriad y stryd (dewisol)

source: Tell us more about your problem (optional)
cy: Dywedwch fwy wrthym am eich problem (dewisol)

source: Do you have any special communication needs? (optional)
cy: Oes gennych chi unrhyw anghenion cyfathrebu arbennig? (dewisol)

source: British Sign Language (BSL)
cy: Iaith Arwyddion Prydain (BSL)

source: Text relay
cy: Cyfnewid testun

source: Welsh
cy: Cymraeg

source: Other language - need an interpreter
cy: Iaith arall – angen cyfieithydd

source: Any other communication need
cy: Unrhyw anghenion cyfathrebu eraill

source: Enter your email address so we can arrange a BSL call
cy: Rhowch eich cyfeiriad e-bost er mwyn i ni allu trefnu galwad Iaith Arwyddion Prydain (BSL)

source: Choose a language
cy: Dewiswch iaith

source: Please tell us what you need
cy: Dywedwch wrthym beth sydd ei angen arnoch

source: Submit details
cy: Cyflwyno manylion

source: Receive this confirmation by email
cy: Cael copi o’r cadarnhad hwn drwy e-bost

source: Enter a valid email address
cy: Rhowch gyfeiriad e-bost dilys

source: Tell us what email address to send to
cy: Dywedwch wrthym pa gyfeiriad e-bost y dylem ei ddefnyddio i anfon

source: Send
cy: Anfon

source: There is a problem
cy: Mae problem

source: per week
cy: yr wythnos

source: 2 weekly
cy: pob 2 wythnos

source: 4 weekly
cy: pob 4 wythnos

source: per month
cy: pob mis

source: per year
cy: y flwyddyn

source: The problem you need help with
cy: Y broblem y mae angen cymorth arnoch gyda hi

source: Change
cy: Newid

source: About you
cy: Amdanoch chi

source: Do you have a partner?
cy: Oes gennych chi bartner?

source: Your husband, wife, civil partner (unless you have permanently separated) or someone you live with as if you're married
cy: Eich gŵr, gwraig, partner sifil (oni bai eich bod wedi gwahanu yn barhaol) neu rywun sy'n byw gyda chi fel pe baech chi wedi priodi

source: Tell us whether you have a partner
cy: Oes gennych chi bartner

source: Are you in a dispute with your partner?
cy: Ydych chi mewn anghydfod â'ch partner?

source: This means your partner is the opponent in the dispute you need help with, for example a dispute over money or property
cy: Mae hyn yn golygu mai eich partner yw’r gwrthwynebydd yn yr anghydfod y mae arnoch angen cymorth ar ei gyfer, er enghraifft anghydfod am arian neu eiddo

source: Tell us whether you're in dispute with your partner
cy: Ydych chi mewn anghydfod â’ch partner

source: Do you receive any benefits (including Child Benefit)?
cy: Ydych chi’n cael unrhyw fudd-daliadau (gan gynnwys Budd-dal Plant)?

source: Being on some benefits can help you qualify for legal aid
cy: Os ydych chi’n cael rhai budd-daliadau, gall hynny eich helpu i gymhwyso ar gyfer cymorth cyfreithiol

source: Tell us whether you receive benefits
cy: Ydych chi'n derbyn budd-daliadau

source: Do you have any children aged 15 or under?
cy: Oes gennych chi blant sy'n 15 oed neu'n iau?

source: Don't include any children who don't live with you
cy: Peidiwch â chynnwys plant nad ydyn nhw'n byw gyda chi

source: Tell us whether you have any children aged 15 or under
cy: Oes gennych chi blant 15 oed neu hŷn

source: How many?
cy: Faint?

source: Tell us how many children you have aged 15 or under
cy: Faint o blant 15 oed neu hŷn sydd gennych chi

source: Enter a number between 1 and 50
cy: Rhowch rif rhwng 1 a 50

source: Do you have any dependants aged 16 or over?
cy: Oes gennych chi unrhyw ddibynyddion sy'n 16 oed neu'n hŷn

source: People who you live with and support financially. This could be a young person for whom you get Child Benefit
cy: Pobl sy'n byw gyda chi ac sy'n cael cymorth ariannol gennych chi. Gallai fod yn berson ifanc yr ydych chi'n cael Budd-dal Plant ar ei gyfer

source: Tell us whether you have any dependants aged 16 or over
cy: Oes gennych chi ddibynyddion 16 oed neu hŷn

source: Tell us how many dependants you have aged 16 or over
cy: Faint o ddibynyddion 16 oed neu hŷn sydd gennych chi

source: Do you own any property?
cy: Ydych chi'n berchen ar unrhyw eiddo?

source: For example, a house, static caravan or flat
cy: Er enghraifft, tŷ, fflat neu garafán sefydlog

source: Tell us if you own any properties
cy: Ydych chi'n berchen ar unrhyw eiddo

source: Are you employed?
cy: Ydych chi'n gyflogedig?

source: This means working as an employee - you may be both employed and self-employed
cy: Mae hyn yn golygu gweithio fel cyflogai - gallech chi fod yn gyflogedig ac yn hunangyflogedig

source: Tell us if you are employed
cy: Ydych chi mewn gwaith

source: Is your partner employed?
cy: Ydy'ch partner yn gyflogedig?

source: This means working as an employee - your partner may be both employed and self-employed
cy: Mae hyn yn golygu gweithio fel cyflogai - gallech chi fod yn gyflogedig ac yn hunangyflogedig

source: Tell us whether your partner is employed
cy: Dywedwch wrthym a yw eich partner yn gyflogedig

source: Are you self-employed?
cy: Ydych chi'n hunangyflogedig?

source: This means working for yourself - you may be both employed and self-employed
cy: Mae hyn yn golygu gweithio i chi'ch hun - gallech chi fod yn gyflogedig ac yn hunangyflogedig

source: Tell us if you are self-employed
cy: Ydych chi'n hunangyflogedig

source: Is your partner self-employed?
cy: Ydy'ch partner yn hunangyflogedig?

source: This means working for yourself - your partner may be both employed and self-employed
cy: Mae hyn yn golygu gweithio i chi'ch hun - gallech chi fod yn gyflogedig ac yn hunangyflogedig

source: Tell us whether your partner is self-employed
cy: Dywedwch wrthym a yw eich partner yn hunangyflogedig

source: Are you or your partner (if you have one) aged 60 or over?
cy: Ydych chi neu eich partner (os oes gennych bartner) yn 60 oed neu'n hŷn?

source: Tell us if you or your partner are aged 60 or over
cy: Ydych chi neu eich partner yn 60 oed neu hŷn

source: Do you have any savings or investments?
cy: Oes gennych chi unrhyw gynilion neu fuddsoddiadau?

source: Tell us whether you have savings or investments
cy: Oes gennych chi gynilion neu fuddsoddiadau

source: Do you have any valuable items worth over £500 each?
cy: Oes gennych chi unrhyw eitemau gwerthfawr sy'n werth mwy na £500 yr un?

source: Tell us if you have any valuable items worth over £500 each
cy: Oes gennych chi eitemau gwerthfawr sydd werth dros £500 yr un

source: Child Benefit
cy: Budd-dal Plant

source: Guarantee Credit
cy: Credyd Gwarant

source: Income Support
cy: Cymhorthdal Incwm

source: Income-based Jobseeker's Allowance
cy: Lwfans Ceisio Gwaith yn seiliedig ar Incwm

source: Income-related Employment and Support Allowance
cy: Lwfans Cyflogaeth a Chymorth yn Seiliedig ar Incwm

source: Universal Credit
cy: Credyd Cynhwysol

source: Any other benefits
cy: Unrhyw fudd-daliadau eraill

source: Which benefits do you receive?
cy: Pa fudd-daliadau ydych chi’n eu cael?

source: Which benefits do you and your partner receive?
cy: Pa fudd-daliadau ydych chi a’ch partner yn eu cael?

source: If yes, enter the total amount you get for all your children
cy: Os ydych, rhowch y cyfanswm rydych chi’n ei gael ar gyfer eich holl blant

source: For example, £32.18 per week
cy: Mae hyn yn cynnwys eich cyflog

source: Enter the Child Benefit you receive
cy: Nodwch y Budd-dal Plant rydych chi’n ei dderbyn

source: Tell us how often you receive Child Benefit
cy: Dywedwch wrthym pa mor aml rydych chi’n derbyn Budd-dal Plant

source: Tell us how much Child Benefit you receive each
cy: Dywedwch wrthym faint o Fudd-dal Plant rydych chi’n ei dderbyn

source: Your additional benefits
cy: Eich budd-daliadau ychwanegol

source: You and your partner’s additional benefits
cy: Eich budd-daliadau ychwanegol chi a’ch partner

source: You’ll need to provide evidence of the financial information you’ve given us through this service.
cy: Bydd angen i chi ddarparu tystiolaeth o’r wybodaeth ariannol yr ydych wedi ei rhoi i ni drwy’r gwasanaeth hwn.

source: Do you get any of these benefits?
cy: Ydych chi yn cael unrhyw un o’r budd-daliadau hyn?

source: Do you or your partner get any of these benefits?
cy: Ydych chi neu’ch partner yn cael unrhyw un o’r budd-daliadau hyn?

source: These benefits don’t count as income. Please tick the ones you receive.
cy: Nid yw’r budd-daliadau hyn yn cael eu cyfrif yn incwm. Ticiwch y rhai yr ydych chi’n eu cael.

source: Armed Forces Independence payment
cy: Taliad Annibyniaeth y Lluoedd Arfog

source: Attendance Allowance
cy: Lwfans Gweini

source: Back to Work Bonus
cy: Bonws Dychwelyd i’r Gwaith

source: Care in the community Direct Payment
cy: Taliad Uniongyrchol am Ofal Cymunedol

source: Carers’ Allowance
cy: Lwfans Gofalwyr

source: Constant Attendance Allowance
cy: Lwfans Gweini Cyson

source: Council Tax Benefits
cy: Budd-daliadau’r Dreth Gyngor

source: Disability Living Allowance
cy: Lwfans Byw i’r Anabl

source: Exceptionally Severe Disablement Allowance
cy: Lwfans Anabledd Difrifol Eithriadol

source: Fostering Allowance
cy: Lwfans Maethu

source: Housing Benefit
cy: Budd-dal Tai

source: Independent Living Funds payment
cy: Taliad Cronfa Byw’n Annibynnol

source: Personal Independence Payments
cy: Taliadau Annibyniaeth Bersonol

source: Severe Disablement Allowance
cy: Lwfans Anabledd Difrifol

source: Social Fund Payments
cy: Taliadau’r Gronfa Gymdeithasol

source: Special Education Needs (SEN) direct payment
cy: Taliad uniongyrchol Anghenion Addysgol Arbennig (SEN)

source: War Pension
cy: Pensiwn Rhyfel

source: Do you receive any other benefits not listed above?
cy: Ydych chi yn cael unrhyw fudd-daliadau eraill sydd heb eu rhestru uchod?

source: Do you or your partner receive any other benefits not listed above?
cy: Ydych chi neu’ch partner yn cael unrhyw fudd-daliadau eraill sydd heb eu rhestru uchod?

source: For example, National Asylum Support Service Benefit, Incapacity Benefit, Contribution-based Jobseeker’s Allowance
cy: Er enghraifft, Budd-dal y Gwasanaeth Cynnal Cenedlaethol i Geiswyr Lloches, Budd-dal Analluogrwydd, Lwfans Ceisio Gwaith yn Seiliedig ar Gyfraniadau

source: Tell us whether you receive any other benefits
cy: Ydych chi’n derbyn unrhyw fudd-daliadau eraill

source: If Yes, total amount of benefits not listed above
cy: Os ydych chi, cyfanswm y budd-daliadau sydd heb eu rhestru uchod

source: Tell us how much you receive in other benefits
cy: Os ydych chi, cyfanswm y budd-daliadau sydd heb eu rhestru uchod

source: Tell us how often you receive these other benefits
cy: Pa mor aml rydych chi’n derbyn y budd-daliadau eraill hyn

source: You and your partner’s income and tax
cy: Eich incwm a’ch treth chi a’ch partner

source: You and your partner’s money coming in
cy: Arian sy’n dod i mewn gennych chi a’ch partner

source: Your income and tax
cy: Eich incwm a’ch treth

source: Your money coming in
cy: Eich enillion rydych yn ei ennill

source: Wages before tax
cy: Cyflog cyn treth

source: This includes any earnings from self-employment
cy: Mae hyn yn cynnwys unrhyw enillion o waith hunangyflogedig

source: This includes all wages and any earnings from self-employment
cy: Mae hyn yn cynnwys eich cyflog i gyd ac unrhyw enillion o waith hunangyflogedig

source: Tell us how much you receive in wages
cy: Dywedwch wrthym faint o gyflog rydych chi’n ei dderbyn

source: Tell us how often you receive wages
cy: Dywedwch wrthym pa mor aml rydych chi’n derbyn cyflog

source: Income tax
cy: Treth incwm

source: Tax paid directly out of wages
cy: Treth sy’n cael ei thalu’n uniongyrchol o’ch cyflog

source: Any tax paid on self-employed earnings
cy: Unrhyw dreth sy’n cael ei thalu o enillion gwaith hunangyflogedig

source: Tax paid directly out of wages and any tax paid on self-employed earnings
cy: Treth sy’n cael ei thalu’n uniongyrchol o’ch cyflog ac unrhyw dreth yr ydych yn ei thalu ar enillion gwaith hunangyflogedig

source: Tell us how much income tax you pay
cy: Dywedwch wrthym faint o dreth incwm rydych chi’n ei thalu

source: Tell us how often you pay income tax
cy: Dywedwch wrthym pa mor aml rydych chi’n talu treth incwm

source: National Insurance contributions
cy: Cyfraniadau Yswiriant Gwladol

source: Check the payslip
cy: Edrychwch ar y slip cyflog

source: Check the National Insurance statement
cy: Edrychwch ar y datganiad Yswiriant Gwladol

source: Check the payslip or National Insurance statement if self-employed
cy: Edrychwch ar y slip cyflog neu’r datganiad Yswiriant Gwladol os ydych yn hunangyflogedig

source: Tell us how much National Insurance you pay
cy: Dywedwch wrthym faint o Yswiriant Gwladol rydych chi’n ei dalu

source: Tell us how often you pay National Insurance
cy: Dywedwch wrthym pa mor aml rydych chi’n talu Yswiriant Gwladol

source: Working Tax Credit
cy: Credyd Treth Gwaith

source: Extra money for people who work and have a low income, enter 0 if this doesn't apply to you
cy: Arian ychwanegol i bobl sy’n gweithio ac sydd ar incwm isel, rhowch 0 os nad yw hyn yn berthnasol i chi

source: Enter the Working Tax Credit you receive, or 0 if this doesn't apply to you
cy: Rhowch y Credyd Treth Gwaith rydych chi’n ei dderbyn, neu 0 os nad yw’n berthnasol i chi

source: Tell us how often you receive Working Tax Credit
cy: Dywedwch wrthym pa mor aml rydych chi’n derbyn Credyd Treth Gwaith

source: Tell us how much Working Tax Credit you receive
cy: Dywedwch wrthym faint o Gredyd Treth Gweithio rydych chi’n ei dderbyn

source: Child Tax Credit
cy: Credyd Treth Plant

source: The total amount you get for all your children, enter 0 if this doesn't apply to you
cy: Y cyfanswm yr ydych chi’n ei gael ar gyfer eich holl blant, rhowch 0 os nad yw hyn yn berthnasol i chi

source: Enter the Child Tax Credit you receive, or 0 if this doesn't apply to you
cy: Rhowch y Credyd Treth Plant rydych chi’n ei dderbyn, neu 0 os nad yw’n berthnasol i chi

source: Tell us how often you receive Child Tax Credit
cy: Dywedwch wrthym pa mor aml rydych chi’n derbyn Credyd Treth Plant

source: Maintenance received
cy: Taliadau Cynhaliaeth yr ydych chi’n eu cael

source: Payments you get from an ex-partner, or enter 0 if this doesn't apply to you
cy: Taliadau yr ydych chi’n eu cael gan gynbartner, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Enter the total amount of maintenance you receive, or 0 if this doesn't apply to you
cy: Rhowch gyfanswm yr arian cynhaliaeth rydych chi’n ei dderbyn, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us how often you receive maintenance
cy: Pa mor aml rydych chi’n derbyn arian cynhaliaeth

source: Tell us how much maintenance you receive
cy: Faint o arian cynhaliaeth rydych chi’n ei dderbyn

source: Pension received
cy: Pensiwn yr ydych chi’n ei gael

source: Payments you receive if you're retired, enter 0 if this doesn't apply to you
cy: Taliadau yr ydych chi’n eu cael os ydych chi wedi ymddeol, rhowch 0 os nad yw hyn yn berthnasol i chi

source: Enter the pension you receive, or 0 if this doesn't apply to you
cy: Rhowch gyfanswm y pensiwn rydych chi’n ei dderbyn, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us how often you receive your pension
cy: Pa mor aml rydych chi’n derbyn eich pensiwn

source: Tell us how much pension you receive
cy: Faint o bensiwn rydych chi’n ei dderbyn

source: Any other income
cy: Unrhyw incwm arall

source: For example, student grants, income from trust funds, dividends, or enter 0 if this doesn't apply to you
cy: Er enghraifft, grantiau myfyriwr, incwm o gronfeydd ymddiriedolaeth, difidendau, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Enter the total amount of other income you receive, or 0 if this doesn't apply to you
cy: Rhowch gyfanswm yr incwm arall rydych chi’n ei dderbyn, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us how often you receive this other income
cy: Pa mor aml rydych chi’n derbyn yr incwm arall hwn

source: Tell us how much other income you receive
cy: Faint o incwm arall rydych chi’n ei dderbyn

source: Tell us how much your partner receives in wages
cy: Dywedwch wrthym faint mae eich partner yn ei dderbyn mewn cyflogau

source: Tell us how often your partner receives wages
cy: Dywedwch wrthym pa mor aml mae eich partner yn derbyn cyflog

source: Tell us how much income tax your partner pays
cy: Dywedwch wrthym faint o dreth incwm mae eich partner yn ei thal

source: Tell us how often your partner pays income tax
cy: Dywedwch wrthym pa mor aml mae eich partner yn talu treth incwm

source: Tell us how much National Insurance your partner pays
cy: Dywedwch wrthym faint o Yswiriant Gwladol mae eich partner yn ei dalu

source: Tell us how often your partner pays National Insurance
cy: Dywedwch wrthym pa mor aml mae eich partner yn talu Yswiriant Gwladol

source: Extra money for people who work and have a low income, enter 0 if this doesn't apply to your partner
cy: Arian ychwanegol i bobl sy’n gweithio ac sydd ar incwm isel, rhowch 0 os nad yw hyn yn berthnasol i chi

source: Enter the Working Tax Credit your partner receives, or 0 if it doesn't apply
cy: Rhowch y Credyd Treth Gwaith rydych chi’n ei dderbyn, neu 0 os nad yw’n berthnasol i chi

source: Tell us how often your partner receives Working Tax Credit
cy: Dywedwch wrthym pa mor aml rydych chi’n derbyn Credyd Treth Gwaith

source: Tell us how much Working Tax Credit your partner receives
cy: Dywedwch wrthym faint o Gredyd Treth Gweithio rydych chi’n ei dderbyn

source: Payments your partner gets from an ex-partner, or enter 0 if this doesn't apply to your partner
cy: Taliadau yr ydych chi’n eu cael gan gynbartner, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Enter the total amount of maintenance your partner receives, or 0 if this doesn't apply
cy: Rhowch gyfanswm yr arian cynhaliaeth rydych chi’n ei dderbyn, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us how often your partner receives maintenance
cy: Pa mor aml rydych chi’n derbyn arian cynhaliaeth

source: Tell us how much maintenance your partner receives
cy: Faint o arian cynhaliaeth rydych chi’n ei dderbyn

source: Payments your partner receives if they're retired, enter 0 if this doesn't apply to your partner
cy: Taliadau yr ydych chi’n eu cael os ydych chi wedi ymddeol, rhowch 0 os nad yw hyn yn berthnasol i chi

source: Enter the pension your partner receives, or 0 if this doesn't apply
cy: Rhowch gyfanswm y pensiwn rydych chi’n ei dderbyn, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us how often your partner receives their pension
cy: Pa mor aml rydych chi’n derbyn eich pensiwn

source: Tell us how much pension your partner receives
cy: Faint o bensiwn rydych chi’n ei dderbyn

source: For example, student grants, income from trust funds, dividends, or enter 0 if this doesn't apply to your partner
cy: Er enghraifft, grantiau myfyriwr, incwm o gronfeydd ymddiriedolaeth, difidendau, neu rhowch 0 os nad yw hyn yn berthnasol i chi
