Repository: ministryofjustice/laa-access-civil-legal-aid
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Please tell us about any property owned by you, your partner or both of you.
cy: Rhowch wybod i ni am unrhyw eiddo yr ydych chi, eich partner neu’r ddau ohonoch yn berchen arno

source: You can add more than one property below.
cy: Gallwch ychwanegu mwy nag un eiddo isod.

source: Remove Property
cy: Dileu eiddo

source: Add another property
cy: Ychwanegu eiddo arall

source: Legal aid doesn’t cover all types of problem
cy: Nid yw cymorth cyfreithiol yn gallu delio â phob math o broblem

source: You can still ask a solicitor for help – you will have to pay for their advice.
cy: Gallwch dal ofyn i gyfreithiwr eich helpu - bydd rhaid ichi dalu am eu cyngor.

source: You can still ask a solicitor for help - you will have to pay for their advice.
cy: Gallwch dal ofyn i gyfreithiwr eich helpu - bydd rhaid ichi dalu am eu cyngor.

source: Find a solicitor
cy: Dod o hyd i gyfreithiwr

source: You may still get help and advice from the organisations listed below. You don’t have to qualify for legal aid.
cy: Efallai y byddwch chi’n dal yn gallu cael help a chyngor gan y sefydliadau sydd wedi’u rhestru isod. Nid oes rhaid i chi fod yn gymwys i gael cymorth cyfreithiol.

source: Help organisations for problems about %(category_name)s
cy: Sefydliadau cymorth ar gyfer problemau ynghylch %(category_name)s

source: About the problem
cy: Am y broblem

source: Any cash, savings or investments held in your name, your partner’s name or both your names.
cy: Unrhyw arian parod, cynilion neu fuddsoddiadau sy’n cael eu dal yn eich enw chi, enw’ch partner neu yn enwau’r ddau ohonoch.

source: What payments do not count as income?
cy: Pa daliadau nad ydynt yn cyfrif fel incwm?

source: Do not include any money you received from:
cy: Peidiwch â chynnwys unrhyw arian a gawsoch gan:

source: The Energy Support Scheme payments (2022 and 2023)
cy: Taliadau’r Cynllun Cymorth Biliau Ynni (2022 a 2023)

source: Cost of living payments
cy: Taliadau costau byw

source: Criminal Injuries Compensation Scheme (CICA)
cy: Cynllun Digolledu am Anafiadau Troseddol (CICA)

source: Grenfell Tower compensation
cy: Iawndal Tŵr Grenfell

source: Modern Slavery Victim Care Contract or National Referral Mechanism (NRM)
cy: Contract Gofalu am Ddioddefwyr Caethwasiaeth Fodern neu’r Mecanwaith Atgyfeirio Cenedlaethol (NRM)

source: National Emergencies Trust
cy: Ymddiriedolaeth Argyfyngau Cenedlaethol

source: London Emergencies Trust
cy: Ymddiriedolaeth Argyfyngau Llundain

source: Variant Creutzfeldt-Jakob Disease (“vCJD”) Trust
cy: Ymddiriedolaeth Clefyd Amrywiolyn Creutzfeldt-Jakob (“vCJD”)

source: Vaccine Damage Payment
cy: Taliad Niwed Trwy Frechiad

source: Victims of Overseas Terrorism Compensation Scheme (VOTCS)
cy: Cynllun Iawndal Dioddefwyr Terfysgaeth Dramor (VOTCS)

source: Scotland and Northern Ireland redress schemes for historical child abuse
cy: Cynlluniau gwneud iawn yr Alban a Gogledd Iwerddon ar achosion hanesyddol o gam-drin

source: Miscarriage of justice compensation
cy: Iawndal Camweinyddu Cyfiawnder

source: We Love Manchester Emergency Fund
cy: Cronfa Argyfwng We Love Manchester

source: Backdated benefit payments
cy: Budd-daliadau wedi’u hôl-ddyddio

source: Backdated child maintenance payments
cy: Taliadau cynhaliaeth plant wedi'u hôl-ddyddio

source: Current page
cy: Tudalen gyfredol

source: Completed page
cy: Tudalen wedi’i chwblhau

source: Future page
cy: Tudalen i’r dyfodol

source: Your progress
cy: Eich cynnydd

source: Contact information
cy: Gwybodaeth gyswllt

source: What valuable items should I include?
cy: Pa eitemau gwerthfawr dylwn i eu cynnwys?

source: Don’t include
cy: Peidiwch â chynnwys

source: Furniture and appliances
cy: Dodrefn ac offer tŷ

source: Your TV
cy: Eich set deledu

source: Mobile phones, laptops and other devices
cy: Ffonau symudol, gliniaduron a dyfeisiau eraill

source: Clothing
cy: Dillad

source: The vehicle you use every day, unless it is a classic car or luxury vehicle
cy: Y car yr ydych chi’n ei ddefnyddio bob dydd, oni bai ei fod yn gar clasurol neu’n gerbyd moethus

source: Equipment or tools you use for your work
cy: Cyfarpar neu offer yr ydych chi’n eu defnyddio ar gyfer eich gwaith

source: Do include
cy: Rhaid cynnwys

source: Jewellery
cy: Gemwaith

source: Art
cy: Gweithiau celfyddydol

source: Antiques
cy: Pethau hynafol

source: Caravans and other vehicles you don’t use every day
cy: Carafannau a cherbydau eraill nad ydych chi’n eu defnyddio bob dydd

source: Musical instruments, unless you’re a professional musician
cy: Offerynnau cerddorol, oni bai’ch bod yn gerddor proffesiynol
