Repository: ministryofjustice/laa-access-civil-legal-aid
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Domestic abuse
cy: Cam-drin domestig

source: Includes controlling behaviour, emotional abuse, or if someone is harassing, threatening or hurting you or a child. This could be a partner, ex-partner, or family member.
cy: Mae hyn yn cynnwys ymddygiad rheolaethol, cam-drin emosiynol, neu os oes rhywun yn aflonyddu, yn eich bygwth neu eich brifo chi neu eich plentyn. Gall hyn fod yn bartner, cyn-bartner, neu aelod o’r teulu.

source: Help to keep yourself safe and protect children
cy: Cymorth i gadw eich hun yn ddiogel ac amddiffyn plant

source: Includes keeping you or your family safe, getting court orders and help if someone is ignoring a court order. Also, if you’re being stalked, threatened or harassed.
cy: Mae hyn yn cynnwys eich cadw chi neu eich teulu’n ddiogel, cael gorchmynion llys a chymorth os bydd rhywun yn anwybyddu gorchymyn llys. Hefyd, os ydych chi’n cael eich stelcio, eich bygwth neu eich aflonyddu.

source: Leaving an abusive relationship
cy: Gadael perthynas gamdriniol

source: Help with divorce, separation, or leaving your partner. Includes legal arrangements for children, money and housing.
cy: Cymorth i ysgaru, i wahanu neu i adael eich partner. Mae hyn yn cynnwys trefniadau cyfreithiol ar gyfer plant, arian a thai.

source: Problems with an ex-partner: children or money
cy: Problemau gyda chyn-bartner: plant neu arian

source: Includes arrangements for children and money. If an ex-partner is not following agreements or court orders. If you’re worried about a child, or if a child is taken or kept without your permission.
cy: Mae'n cynnwys trefniadau ar gyfer plant ac arian. Os nad yw cynbartner yn dilyn cytundebau neu orchmynion llys. Os ydych chi'n poeni am blentyn, neu os yw plentyn yn cael ei gymryd neu ei gadw heb eich caniatâd.

source: Housing, homelessness, losing your home
cy: Tai, digartrefedd, colli eich cartref

source: Includes being forced to leave your home, problems with council housing, if you’re homeless or might be homeless in the next 2 months.
cy: Mae hyn yn cynnwys cael eich gorfodi i adael eich cartref, problemau gyda thai cyngor, os ydych chi'n ddigartref neu y gallech fod yn ddigartref yn ystod y 2 fis nesaf.

source: Forced Marriage
cy: Priodas dan orfod

source: Help with forced marriage and Forced Marriage Protection Orders.
cy: Cymorth gyda phriodas dan orfod a Gorchmynion Amddiffyn rhag Priodas dan Orfod.

source: Female genital mutilation (FGM)
cy: Anffurfio Organau Cenhedlu Benywod (FGM)

source: If you or someone else is at risk of FGM.
cy: Os ydych chi neu rywun arall mewn perygl o FGM.

source: Domestic abuse - if you have been accused
cy: Os ydych chi wedi cael eich cyhuddo o gam-drin domestig

source: Legal help if you’ve been accused of domestic abuse or forced marriage. Includes non-molestation orders and other court orders.
cy: Cymorth cyfreithiol os ydych chi wedi cael eich cyhuddo o gam-drin domestig neu briodas dan orfod. Mae hyn yn cynnwys gorchmynion rhag molestu, a gorchmynion llys eraill.

source: Children, families, relationships
cy: Plant, teuluoedd, perthnasoedd

source: Includes children in care, children and social services. Also, help with children and finances if you divorce or split up.
cy: Mae hyn yn cynnwys, plant mewn gofal, plant, a gwasanaethau cymdeithasol. Yn ogystal â chymorth ariannol a chymorth gyda phlant os ydych chi’n ysgaru neu’n gwahanu.

source: Children and social services, children in care
cy: Plant a gwasanaethau cymdeithasol, plant mewn gofal

source: Help for any problem if social services are involved with a child. Includes children in care, or being adopted. Also special guardianship.
cy: Cymorth ar gyfer unrhyw broblem os yw’r gwasanaethau cymdeithasol yn ymwneud â phlentyn. Mae hyn yn cynnwys plant mewn gofal, neu sy’n cael eu mabwysiadu. Yn ogystal â gwarcheidwadaeth arbennig.

source: Problems with an ex-partner, divorce, when a relationship ends
cy: Problemau gyda chyn-bartner, ysgariad, pan fydd perthynas yn dod i ben

source: If you cannot agree about money, finances and property. Includes contact with children, where children live, and other child arrangements. If an ex-partner is not doing what they agreed. If you’re worried about a child.
cy: Os na allwch chi gytuno ar arian, cyllid ac eiddo. Mae hyn yn cynnwys cyswllt â phlant, lle mae plant yn byw, a threfniadau eraill ar gyfer plant. Os nad yw cyn-bartner yn gwneud yr hyn y cytunwyd arno. Os ydych chi’n poeni am blentyn.

source: If there is domestic abuse in your family
cy: Os oes achos o gam-drin domestig yn eich teulu

source: Making arrangements for children and finances. Also, keeping yourself safe, protecting children and legal help to leave the relationship.
cy: Gwneud trefniadau o ran plant a chyllid. Hefyd, cadw eich hun yn ddiogel, amddiffyn plant a chymorth cyfreithiol i adael y berthynas.

source: Family mediation
cy: Cyfryngu teuluol

source: Help to cover the costs of family mediation (solve problems about money and children before you go to court).
cy: Cymorth i dalu costau cyfryngu teuluol (datrys problemau ynghylch arian a phlant cyn i chi fynd i’r llys).

source: Child taken without your consent
cy: Plentyn a gymerwyd heb eich caniatâd

source: If a child has been abducted (taken without your permission), including outside the UK.
cy: Os yw plentyn wedi cael ei gipio (ei gymryd heb eich caniatâd), gan gynnwys y tu allan i'r DU.

source: Children with special educational needs and disabilities (SEND)
cy: Plant ag anghenion addysgol arbennig ac anableddau (SEND)

source: Get help with a child’s SEND.
cy: Cael help gyda SEND plentyn.

source: Schools, colleges, other education settings
cy: Ysgolion, colegau, lleoliadau addysg eraill

source: Advice about legal action against a school. Includes if a child is out of school, exclusions, transport to school, judicial reviews.
cy: Cyngor ar gamau cyfreithiol yn erbyn ysgol. Mae hyn yn cynnwys os nad yw plentyn yn mynd i’r ysgol, gwaharddiadau, cludiant i’r ysgol, adolygiadau barnwrol.

source: Forced marriage
cy: Priodas dan orfod

source: Includes being evicted or forced to sell your home. Problems with landlords, repairs, neighbours or council housing.
cy: Mae hyn yn cynnwys cael eich troi allan neu gael eich gorfodi i werthu eich cartref. Problemau gyda landlordiaid, gwaith atgyweirio, cymdogion, neu dai cyngor.

source: Homelessness
cy: Digartrefedd

source: Help if you’re homeless, or might be homeless in the next 2 months. This could be because of rent arrears, debt, the end of a relationship, or because you have nowhere to live.
cy: Cymorth os ydych chi'n ddigartref, neu os gallech chi fod yn ddigartref yn ystod y 2 fis nesaf. Gallai hyn fod oherwydd ôl-ddyledion rhent, dyled, diwedd perthynas, neu oherwydd nad oes gennych unman i fyw.

source: Eviction, told to leave your home
cy: Troi allan, wedi cael cyfarwyddyd i adael eich cartref

source: Landlord has told you to leave or is trying to force you to leave. Includes if you’ve got a Section 21 or a possession order.
cy: Mae’r landlord wedi dweud wrthych am adael neu mae’n ceisio eich gorfodi i adael. Mae’n cynnwys os oes gennych chi orchymyn Adran 21 neu orchymyn meddiannu.

source: Forced to sell or losing the home you own
cy: Cael eich gorfodi i werthu neu golli’r cartref rydych chi’n berchen arno

source: Repossession by your mortgage company; bankruptcy or other debt that means you will lose the home you own.
cy: Adfeddiant gan eich cwmni morgais; methdaliad neu ddyled arall sy’n golygu y byddwch yn colli’r cartref yr ydych yn berchen arno.

source: Repairs, health and safety
cy: Atgyweirio, iechyd a diogelwch

source: If your house is not safe to live in, or needs repairs, and this is causing health or safety problems.
cy: Os nad yw eich tŷ yn ddiogel i fyw ynddo, neu os oes angen ei atgyweirio, a bod hyn yn achosi problemau iechyd neu ddiogelwch.

source: Problems with council housing
cy: Problemau gyda thai cyngor

source: Help to challenge the council’s decision about giving you housing. It includes if the council has offered a house that is not right for you, or that needs repairs or adaptations.
cy: Helpu i herio penderfyniad y cyngor ynghylch rhoi tŷ i chi. Mae hyn yn cynnwys os yw'r cyngor wedi cynnig tŷ nad yw'n addas i chi, neu fod angen ei atgyweirio neu ei addasu.

source: Being threatened or harassed where you live
cy: Cael eich bygwth neu eich aflonyddu lle rydych chi’n byw

source: By a landlord, neighbour or someone else.
cy: Gan landlord, cymydog neu rywun arall.

source: If you’re an asylum-seeker
cy: Os ydych chi'n geisiwr lloches

source: Applying for housing, losing your housing or homelessness.
cy: Gwneud cais am dŷ, colli eich cartref neu ddigartrefedd.

source: Discrimination
cy: Gwahaniaethu

source: Treated unfairly by a landlord, council or housing association.
cy: Cael eich trin yn annheg gan landlord, cyngor neu gymdeithas dai.

source: If you’ve been accused of anti-social behaviour
cy: Os cawsoch eich cyhuddo o ymddygiad gwrthgymdeithasol

source: Accused of anti-social behaviour by the landlord, council or housing association.
cy: Wedi cael eich cyhuddo o ymddygiad gwrthgymdeithasol gan y landlord, y cyngor neu'r gymdeithas dai.

source: Anti-social behaviour and gangs
cy: Ymddygiad gwrthgymdeithasol a gangiau

source: If you’re accused or taken to court for anti-social behaviour, including being in a gang.
cy: Os ydych chi wedi cael eich cyhuddo neu wedi ymddangos yn y llys am ymddwyn yn wrthgymdeithasol, gan gynnwys bod yn aelod o gang.

source: Problems with neighbours, landlords or other people
cy: Problemau gyda chymdogion, landlordiaid neu bobl eraill

source: Threats, abuse or harassment by someone who is not a family member.
cy: Bygythiadau, cam-drin neu aflonyddu gan rywun nad yw’n aelod o’r teulu.

source: Treated unfairly because of things like your disability or health condition, race, age, sex, religion or pregnancy.
cy: Wedi cael eich trin yn annheg oherwydd pethau fel eich anabledd neu gyflwr iechyd, hil, oed, rhyw, crefydd neu feichiogrwydd.

source: Special educational needs and disability (SEND)
cy: Anghenion addysgol arbennig ac anableddau (SEND)

source: Help if your child has SEND.
cy: Cymorth os oes gan eich plentyn anghenion addysgol arbennig ac anableddau.

source: Help with a child or young person's SEND
cy: Cymorth gyda SEND plentyn neu berson ifanc

source: Help with schools, other education settings and local authorities. Includes help with education, health and care plans (EHCP) or if a child’s needs are not being met.
cy: Cymorth gydag ysgolion, lleoliadau addysg eraill ac awdurdodau lleol. Mae hyn yn cynnwys cymorth gyda chynlluniau addysg, iechyd a gofal (EHCP) neu os nad yw anghenion plentyn yn cael eu diwallu.

source: SEND tribunals
cy: Tribiwnlysoedd SEND

source: Applying for or going to a SEND tribunal, appealing a decision by a tribunal.
cy: Gwneud cais i dribiwnlys SEND neu fynd i dribiwnlys SEND, apelio yn erbyn penderfyniad gan dribiwnlys.

source: Child treated unfairly at school, discrimination
cy: Plentyn yn cael ei drin yn annheg yn yr ysgol, gwahaniaethu

source: If a child is treated unfairly at school because of their disability. Or if you were treated badly for complaining about this.
cy: Os caiff plentyn ei drin yn annheg yn yr ysgol oherwydd ei anabledd. Neu os cawsoch chi eich trin yn wael am gwyno am hyn.

source: Other problems with schools
cy: Problemau eraill gydag ysgolion

source: Care needs for disability (social care)
cy: Anghenion gofal ar gyfer anabledd neu henaint (gofal cymdeithasol)

source: Problems getting the local authority or council to provide or pay for the right care. For carers, children, young people and adults.
cy: Problemau wrth gael yr awdurdod lleol neu’r cyngor i ddarparu neu dalu am y gofal cywir. Ar gyfer plant, pobl ifanc ac oedolion.

source: Care needs for disability and old age (social care)
cy: Anghenion gofal ar gyfer anabledd a henaint (gofal cymdeithasol)

source: Care from the council (local authority)
cy: Gofal gan y cyngor (awdurdod lleol)

source: Includes problems with care needs assessments, financial assessments and care support plans. Getting an advocate for assessments. Problems with transport, personal budgets and direct payments.
cy: Mae hyn yn cynnwys problemau gydag asesiadau o anghenion gofal, asesiadau ariannol a chynlluniau cymorth gofal. Cael eiriolwr ar gyfer asesiadau. Problemau gyda thrafnidiaeth, cyllidebau personol a thaliadau uniongyrchol.

source: If you’re a carer
cy: Os ydych chi'n ofalwr

source: Includes problems with carer’s assessments and respite care. Problems to do with making decisions about someone’s care.
cy: Yn cynnwys problemau gydag asesiadau gofalwyr a gofal seibiant. Problemau sy’n ymwneud â gwneud penderfyniadau am ofal rhywun.

source: If you receive care in your own home
cy: Os ydych chi'n cael gofal yn eich cartref eich hun

source: Problems with care providers, social workers, care agencies. Also getting adaptations and disabled facilities grants.
cy: Problemau gyda darparwyr gofal, gweithwyr cymdeithasol, asiantaethau gofal. Hefyd cael grantiau addasiadau a grantiau cyfleusterau i bobl anabl.

source: If care or funding stops
cy: Os bydd gofal neu gyllid yn dod i ben

source: Problems if care or money for care is stopped or reduced, or if care facilities close.
cy: Problemau os yw gofal neu arian ar gyfer gofal yn cael ei atal neu ei leihau, neu os yw cyfleusterau gofal yn cau.

source: Placements, care homes and care housing
cy: Lleoliadau, cartrefi gofal a thai gofal

source: Problems with placements in care homes, group homes or other supported housing. If a placement isn't working because someone's care needs have changed.
cy: Problemau gyda lleoliadau mewn cartrefi gofal, cartrefi grŵp neu dai â chymorth eraill. Os nad yw lleoliad yn gweithio oherwydd bod anghenion gofal rhywun wedi newid.

source: Problems with the quality of care, safeguarding
cy: Problemau gydag ansawdd gofal, diogelu

source: Issues with safeguarding, abuse, neglect, or care that is not good enough. This includes in group homes or other placements, or from a carer or social worker.
cy: Materion yn ymwneud â diogelu, cam-drin, esgeuluso, neu ofal nad yw’n ddigon da. Mae hyn yn cynnwys mewn cartrefi grŵp neu leoliadau eraill, neu gan ofalwr neu weithiwr cymdeithasol.

source: If you’re a care leaver
cy: Os ydych chi wedi gadael gofal

source: Problems if the local authority is not providing the right support. Includes problems with housing, financial support, education, personal advisers and Pathway Plans.
cy: Problemau os nad yw’r awdurdod lleol yn darparu’r gefnogaeth gywir. Mae hyn yn cynnwys problemau gyda thai, cymorth ariannol, addysg, ymgynghorwyr personol a Chynlluniau Llwybr.

source: Benefits
cy: Budd-daliadau

source: Welfare benefits
cy: Budd-daliadau lles

source: Appeal a decision about your benefits.
cy: Apelio penderfyniadau am eich budd-daliadau.

source: Legal action against police and public organisations
cy: Camau cyfreithiol yn erbyn yr heddlu a sefydliadau cyhoeddus

source: Includes police, government, prisons, NHS, the council, care facilities and schools.
cy: Mae hyn yn cynnwys yr heddlu, y llywodraeth, carchardai, y GIG, cyfleusterau gofal, ac ysgolion.

source: Asylum and immigration
cy: Lloches a mewnfudo

source: Help if you’re seeking asylum. Help to stay in the UK if you experienced domestic abuse.
cy: Cymorth os ydych chi’n ceisio lloches. Cymorth i aros yn y Deyrnas Unedig os ydych chi wedi profi cam-drin domestig.

source: Applying for asylum
cy: Gwneud cais am loches

source: Help to apply for asylum, go to asylum interviews, or appeal an asylum decision.
cy: Cymorth i wneud cais am loches, mynd i gyfweliadau lloches, neu apelio yn erbyn penderfyniad am loches.

source: Housing and homelessness
cy: Tai a digartrefedd

source: Help to apply for housing, problems with housing or if you are homeless.
cy: Cymorth i wneud cais am dŷ, problemau gyda thai neu os ydych chi'n ddigartref.

source: Stay in the UK if you experienced domestic abuse
cy: Aros yn y DU os ydych chi wedi profi cam-drin domestig

source: Help to remain in the UK or EU if your relationship ended because of domestic abuse. This could be by a partner, ex-partner or family member.
cy: Cymorth i aros yn y DU neu’r UE os daeth eich perthynas i ben oherwydd cam-drin domestig. Gallai hyn fod gan bartner, cyn-bartner neu aelod o’r teulu.

source: Help if you’re being detained
cy: Cymorth os ydych chi'n cael eich cadw'n y ddalfa

source: Help if you’re in immigration detention, including if you want to apply for bail. Help if you’re in prison.
cy: Cymorth os ydych chi’n cael eich cadw dan reolau mewnfudo, gan gynnwys os ydych chi eisiau gwneud cais am fechnïaeth. Cymorth os ydych chi yn y carchar.

source: Trafficking, modern slavery
cy: Masnachu pobl, caethwasiaeth fodern

source: Help if you’re a victim of trafficking or modern slavery.
cy: Cymorth os ydych chi’n ddioddefwr masnachu pobl neu gaethwasiaeth fodern.

source: Mental capacity, mental health
cy: Galluedd meddyliol, iechyd meddwl

source: Help if someone cannot make decisions about their health, day-to-day life or care. Help at mental health tribunals.
cy: Cymorth os nad yw rhywun yn gallu gwneud penderfyniadau am eu hiechyd, bywyd o ddydd i ddydd na gofal. Cymorth mewn tribiwnlysoedd iechyd meddwl.

source: If someone cannot decide for themselves (lacks mental capacity)
cy: Os na all rhywun benderfynu drosto’i hun (diffyg galluedd meddyliol)

source: Help to challenge a decision made about someone’s living arrangements, care, health, relationships, family contact or finances. Includes if someone is deprived of their liberty, and ‘deprivation of liberty safeguards’ (DoLS).
cy: Cymorth i herio penderfyniad a wnaethpwyd am drefniadau byw, gofal, iechyd, perthnasoedd, cyswllt teuluol neu gyllid rhywun. Mae hyn yn cynnwys os yw rhywun yn cael ei amddifadu o’i ryddid, a ‘threfniadau diogelu wrth amddifadu o ryddid’ (DoLS).

source: Court of Protection
cy: Y Llys Gwarchod

source: Advice about issues covered by the Court of Protection.
cy: Cyngor ar faterion y mae’r Llys Gwarchod yn ymdrin â nhw.

source: Mental health detention and tribunals
cy: Canolfannau cadw a thribiwnlysoedd iechyd meddwl

source: Help if someone has been sectioned (held in a mental health hospital), or is under a community treatment order. Help with mental health tribunals.
cy: Cymorth os bydd rhywun wedi cael ei gadw mewn ysbyty iechyd meddwl, neu os yw o dan orchymyn triniaeth gymunedol. Help gyda thribiwnlysoedd iechyd meddwl.

source: Adopting a child from outside the UK
cy: Mabwysiadu plentyn o'r tu allan i’r Deyrnas Unedig

source: Adoption processes in the courts.
cy: Y broses fabwysiadu yn y llysoedd.

source: Appeal a decision that you cannot work with children or vulnerable adults
cy: Apelio penderfyniad sy’n nodi nad ydych chi’n cael gweithio gyda phlant ac oedolion bregus

source: Including if you’re on a ‘barred list’ or disqualified from teaching.
cy: Mae hyn yn cynnwys bod ar ‘restr gwahardd’ neu gael eich gwahardd rhag addysgu.

source: Clinical negligence in babies
cy: Esgeulustra clinigol mewn babanod

source: Help if a baby has brain or nerve damage caused during pregnancy, childbirth or up to 8 weeks old.
cy: Cymorth os yw babi wedi profi niwed i’r ymennydd neu'r system nerfol yn ystod beichiogrwydd, genedigaeth, neu cyn cyrraedd 8 wythnos oed

source: Compensation for abuse, assault or neglect
cy: Iawndal am gamdriniaeth, ymosodiad neu esgeulustod

source: Includes child abuse, sexual assault, abuse of a vulnerable adult. Claims can be against a person or an organisation.
cy: Mae hyn yn cynnwys cam-drin plant, ymosod yn rhywiol, cam-drin oedolyn bregus. Gallwch chi hawlio iawndal gan berson neu sefydliad.

source: Environmental pollution
cy: Llygredd amgylcheddol

source: Issues about air, water or land pollution that is harming you or the environment.
cy: Materion am lygredd aer, dŵr a thir sy’n achosi niwed i chi neu'r amgylchedd.

source: Inquests for family members
cy: Cwestau aelodau o’r teulu

source: Advice to prepare for the inquest of a family member.
cy: Cyngor ar sut i baratoi ar gyfer cwest aelod o’r teulu.

source: Mental health detention
cy: Cadw dan glo oherwydd iechyd meddwl

source: Help if you’re held in hospital (‘sectioned’), mental health tribunals and community treatment orders.
cy: Cymorth os ydych chi’n cael eich cadw yn yr ysbyty, tribiwnlysoedd iechyd meddwl, a gorchmynion triniaeth gymunedol.

source: Proceeds of Crime Act
cy: Deddf Enillion Troseddau

source: If you’re facing legal action to take your money or other assets.
cy: Os oes camau cyfreithiol ar waith i gymryd eich arian neu asedau eraill.

source: Terrorism
cy: Terfysgaeth

source: If you’re accused of terrorism or financing terrorist groups.
cy: Os ydych chi’n cael eich cyhuddo o derfysgaeth neu o ariannu grwpiau terfysgol.

source: Help if you’re a victim of human trafficking or modern slavery.
cy: Cymorth os ydych chi’n ddioddefwr masnachu pobl neu gaethwasiaeth fodern.

source: special educational needs and disability (SEND)
cy: plant ag anghenion addysgol arbennig ac anableddau (SEND)

source: Yes
cy: Ydw

source: No
cy: Nac ydw

source: Continue
cy: Parhau

source: Are you worried about someone's safety?
cy: Ydych chi’n poeni am ddiogelwch rhywun?

source: This could be you, a child or someone else.
cy: Gallai hyn fod yn chi, yn blentyn neu'n rhywun arall.

source: Select if you’re worried about someone’s safety
cy: Dewiswch os ydych chi’n poeni am ddiogelwch rhywun

source: Is this about a child who is or has been in care?
cy: A yw hyn yn ymwneud â phlentyn sydd mewn gofal neu sydd wedi bod mewn gofal?

source: Select if the child is or has been in care
cy: Dewiswch a yw’r plentyn mewn gofal neu wedi bod mewn gofal

source: or
cy: neu

source: Where will the appeal be held?
cy: Ble fydd yr apêl yn cael ei chynnal?

source: Select where the appeal will be held
cy: Dewiswch ble bydd yr apêl yn cael ei chynnal

source: Upper Tribunal (Administrative Appeals Chamber)
cy: Uwch Dribiwnlys (Siambr Apeliadau Gweinyddol)

source: Supreme Court
cy: Goruchel Lys

source: Court of Appeal
cy: Llys Apêl

source: None of these
cy: Dim un o'r rhain

source: Where did the discrimination happen?
cy: Ble digwyddodd y gwahaniaethu?

source: You can select more than one.
cy: Gallwch ddewis mwy nag un.

source: Select where the discrimination happened
cy: Dewiswch ble y digwyddodd y gwahaniaethu

source: Work - including colleagues, employer or employment agency
cy: Yn y gwaith – gan gynnwys cydweithwyr, cyflogwr neu asiantaeth gyflogi

source: School, college, university or other education setting
cy: Yn yr ysgol, coleg, prifysgol neu leoliad addysg arall

source: Businesses or services - such as a shop, restaurant, train, hotel, bank, law firm
cy: Busnesau neu wasanaethau – fel siop, bwyty, trên, gwesty, banc, cwmni cyfreithiol

source: Health or care - such as a hospital or care home
cy: Iechyd neu ofal – fel ysbyty neu gartref gofal

source: Housing - such as a landlord or estate agent
cy: Tai – fel landlord neu asiant tai

source: Public services and authorities - such as the police, social services, council or local authority, jobcentre, government
cy: Gwasanaethau cyhoeddus ac awdurdodau – fel yr heddlu, gwasanaethau cymdeithasol, cynghorau neu awdurdodau lleol, canolfannau gwaith, y llywodraeth

source: Clubs and associations - such as a sports club
cy: Clybiau a chymdeithasau – fel clwb chwaraeon

source: I’m not sure
cy: Dydw i ddim yn siŵr

source: Why were you discriminated against?
cy: Pam y gwahaniaethwyd yn eich erbyn?

source: Select why you were discriminated against
cy: Dewiswch pam y gwahaniaethwyd yn eich erbyn
