Repository: ministryofjustice/laa-access-civil-legal-aid
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Protecting your personal data and your privacy is important to us. Read the full <a class="govuk-link" href="%(privacy_link)s">Civil Legal Advice Privacy Statement</a>.
cy: Mae diogelu’ch data personol a phreifatrwydd yn bwysig i ni. Darllennwch y <a class="govuk-link" href="%(privacy_link)s">Datganiad Preifatrwydd Cyngor Cyfreithiol yn llawn</a>.

source: What if I miss the operator’s call?
cy: Beth fydd yn digwydd os byddaf yn methu galwad y gweithredwr?

source: If you miss the call or you need advice urgently, you can call us on <strong>0345 345 4 345</strong>. Find out about <a class="govuk-link" href="https://www.gov.uk/call-charges" rel="external">call charges</a>.
cy: Os byddwch yn methu’r alwad neu angen cyngor ar frys, gallwch ein ffonio ar 0345 345 4 345. <a class="govuk-link" href="https://www.gov.uk/costau-galwadau">Mae gwybodaeth am gostau’r galwadau i’w cael yma.</a>

source: We’ll give you the Civil Legal Advice phone number when you submit your details.
cy: Byddwn yn rhoi rhif ffôn Civil Legal Advice i chi pan fyddwch yn cyflwyno eich manylion.

source: We’ll call during the time you choose.
cy: Byddwn yn galw chi yn ystod yr amser rydych chi’n dewis

source: The call will come from an unknown or withheld number.
cy: Bydd y galwad yn dod o rif anghyfarwydd neu wedi ei ddal yn ôl

source: If you miss the call, we will call 2 more times in the next few days.
cy: Os ydych chi’n colli’r galwad, byddwn yn galw chi yn ôl dwywaith eto dros y dyddiau nesaf.

source: We will not leave a message.
cy: Byddwn ni ddim yn gadael neges.

source: If you miss all 3 calls, or if you need urgent advice, call us on:
cy: Os gollwch chi'r tair galwad, neu os rydych chi angen gymorth ar brys, galwch ni ar y rhif canlynol:

source: You must be with the person when we call.
cy: Byddwn yn galw chi yn ystod yr amser rydych chi’n dewis

source: If you’re in an emergency situation, please call the police on 999.
cy: Os ydych mewn sefyllfa argyfwng, ffoniwch yr heddlu ar 999.

source: If you’re in immediate danger please call Civil Legal Advice on
cy: Os ydych mewn perygl uniongyrchol, ffonwich Cyngor Cyfreithiol Sifil ar

source: Call charges apply.
cy: Cyfraddau galwadau yn berthnasol

source: You can also ask us to call you back using the form below, which is free.
cy: Gallwch hefyd ofyn i ni eich ffonio’n ôl gan ddefnyddio’r ffurflen isod, sydd yn rhad ac am ddim.

source: Civil Legal Advice will check if you can get legal aid and help you contact the right legal adviser. If you cannot get legal aid, we’ll tell you about other help you can get.
cy: Bydd Cyngor Cyfreithiol Sifil yn gwirio os allwch chi gael cymorth cyfreithiol, a byddan nhw yn eich helpu i gysylltu efo’r cynghorydd cyfreithiol cywir. Os na allwch chi gael cymorth cyfreithiol, mi fydden ni’n hysbysu chi am gymorth arall sydd ar gael.

source: You can call Civil Legal Advice yourself - this is an 0345 number, so <a class="govuk-link" href="https://www.gov.uk/call-charges">call charges</a> apply. Or you can ask us to call you back, which is free.
cy: Gallwch chi alw Cyngor Cyfreithiol Sifil eich hun – mae hon yn rhif 0345, felly bydd <a class="govuk-link" href="https://www.gov.uk/call-charges"> tâl galwad</a>. Neu mi allwch chi ofyn i ni alw chi yn ôl, sydd am ddim.

source: We’ll ask questions about your legal problem and your financial situation. You might need to provide evidence of any financial information you give us.
cy: Byddwn ni’n gofyn cwestiynau am eich problem gyfreithiol ac eich sefyllfa gyllidol. Efallai bydd rhaid i chi ddangos tystiolaeth o unrhyw wybodaeth ariannol rydych chi’n cyflenwi.

source: Address
cy: Pellter

source: Find UK Address
cy: Dod o hyd i gyfeiriad yn y DU

source: Your session will time out after 30 minutes of inactivity. We do this for your security.
cy: Bydd eich sesiwn yn dod i ben os yw wedi bod yn anweithredol am hanner awr. Rydym yn gwneud hyn er mwyn eich cadw’n ddiogel.

source: Civil Legal Advice Privacy Statement
cy: Datganiad Preifatrwydd Cyngor Cyfreithiol Sifil

source: Protecting your personal data and your privacy is important to us. Read the full %(privacy_link)s.
cy: Mae diogelu’ch data personol a phreifatrwydd yn bwysig i ni. Darllennwch y %(privacy_link)s.

source: In some cases, you may need to pay a contribution towards your legal aid.
cy: Mewn rhai achosion, os ydych yn gymwys, mae’n bosibl y bydd angen i chi dalu cyfraniad tuag at eich cymorth cyfreithiol.

source: Complete your application by submitting your details below.
cy: Cwblhewch eich cais drwy gyflwyno eich manylion isod.

source: call charges
cy: cyfraddau galwadau

source: Sorry, the service is unavailable
cy: Yn anffodus, dydy'r gwasanaeth hwn ddim ar gael

source: The service will be available again soon - try in the next hour.
cy: Bydd y gwasanaeth ar gael eto’n fuan - rhowch gynnig arall arni yn yr awr nesaf.

source: If you already started using the service, your answers will not be saved.
cy: Os ydych chi eisoes wedi dechrau defnyddio'r gwasanaeth, fydd eich atebion ddim yn cael eu cadw.

source: If you need urgent help
cy: Os oes angen cymorth brys arnoch

source: Contact the Civil Legal Advice (CLA) helpline.
cy: Cysylltwch â llinell gymorth Cyngor Cyfreithiol Sifil (y CLA).

source: Telephone
cy: Ffôn

source: (textphone and app): 18001 then 0345 345 4345
cy: ffôn testun ac ap: 18001 yna 0345 345 4345

source: Monday to Friday, 9am to 8pm
cy: O ddydd Llun i ddydd Gwener rhwng 9am a 8pm

source: Saturday, 9am to 12:30pm
cy: Dydd Sadwrn, rhwng 9am a 12:30pm

source: Find out about call charges
cy: Rhagor o wybodaeth am gost galwadau

source: If you’re worried about the cost of a call
cy: Os ydych chi’n poeni am gost yr alwad

source: ask the helpline to call you back, or
cy: gofynnwch i’r llinell gymorth eich ffonio’n ôl, neu

source: text ‘legalaid’ and your name to 80010 for a call back within 24 hours
cy: tecstiwch ‘legalaid’ a’ch enw i 80010 a byddan nhw’n eich ffonio’n ôl o fewn 24 awr

source: Your application will time out soon
cy: Bydd yr amser a neilltuwyd ar gyfer eich cais yn dod i ben cyn bo hir

source: Extend time limit
cy: Ymestyn y terfyn amser

source: Exit service
cy: Gadael y gwasanaeth

source: Web Content Accessibility Guidelines version 2.1 (opens in new tab)
cy: Canllawiau Hygyrchedd Cynnwys y We fersiwn 2.1 (yn agor mewn tab newydd)

source: Using this service
cy: Defnyddio’r gwasanaeth hwn

source: This accessibility statement applies to <a class="govuk-link" href="https://checklegalaid.service.gov.uk/">https://checklegalaid.service.gov.uk/</a>.
cy: Mae'r datganiad hygyrchedd hwn yn ymwneud â <a class="govuk-link" href="https://checklegalaid.service.gov.uk/">https://checklegalaid.service.gov.uk/</a>.

source: The Legal Aid Agency (<abbr>LAA</abbr>) is responsible for the Civil Legal Advice (<abbr>CLA</abbr>) service.
cy: Yr Asiantaeth Cymorth Cyfreithiol (<abbr>LAA</abbr>) sy'n gyfrifol am y gwasanaeth Cyngor Cyfreithiol Sifil (<abbr>CLA</abbr>).

source: We want as many people as possible to be able to use this service. For example, that means you should be able to:
cy: Rydyn ni am i gynifer o bobl â phosibl allu defnyddio’r gwasanaeth hwn. Er enghraifft, mae hynny’n golygu y dylech allu:

source: change colours, contrast levels and fonts
cy: newid lliwiau, lefelau cyferbyniad a ffontiau

source: zoom in up to 300&#37; without the text spilling off the screen
cy: chwyddo mewn hyd at 300&#37; heb i’r testun ollwng oddi ar y sgrin

source: navigate the service using just a keyboard
cy: symud o gwmpas gan ddefnyddio bysellfwrdd yn unig

source: AbilityNet has advice on making your device easier to use if you have a disability (opens in new tab)
cy: Mae gan AbilityNet gyngor ar wneud eich dyfais yn haws ei defnyddio os oes gennych chi anabledd (yn agor mewn tab newydd)

source: Feedback and contact information
cy: Adborth a gwybodaeth gyswllt

source: If you need information on this service in a different format, you can contact us at %(email_link)s.
cy: Os oes angen gwybodaeth arnoch am y gwasanaeth hwn mewn fformat gwahanol, gallwch gysylltu â ni yn %(email_link)s.

source: Reporting accessibility problems
cy: Rhoi gwybod am broblemau hygyrchedd

source: We’re always looking to improve the accessibility of this service. If you find any problems that aren’t listed on this page or think we’re not meeting the requirements of the accessibility regulations, contact %(email_link)s giving details of the issue and any assistive technology you are using.
cy: Rydyn ni bob amser yn ceisio gwella hygyrchedd y gwasanaeth hwn. Os byddwch chi’n dod o hyd i unrhyw broblemau nad ydynt wedi’u rhestru ar y dudalen hon neu os ydych chi’n meddwl nad ydyn ni’n bodloni gofynion y rheoliadau hygyrchedd, cysylltwch â %(email_link)s gan roi manylion y broblem ac unrhyw dechnoleg gynorthwyol rydych chi’n ei defnyddio.

source: Enforcement procedure
cy: Gweithdrefn gorfodi

source: The Equality and Human Rights Commission (<abbr>EHRC</abbr>) is responsible for enforcing the accessibility regulations. If you’re not happy with how we respond to your complaint, contact the <a class="govuk-link" href="https://www.equalityadvisoryservice.com/" is_external=True target="_blank" rel="noopener noreferrer">Equality Advisory and Support Service (<abbr>EASS</abbr>) (opens in new tab)</a>.
cy: Y Comisiwn Cydraddoldeb a Hawliau Dynol sy’n gyfrifol am orfodi’r rheoliadau hygyrchedd. Os nad ydych chi’n fodlon â sut rydyn ni’n ymateb i’ch cwyn, cysylltwch â’r <a class="govuk-link" href="http://eass-ws.custhelp.com/app/home" rel="external">Gwasanaeth Cynghori a Chefnogi Cydraddoldeb (<abbr>EASS</abbr>) (yn agor mewn tab newydd)</a>.

source: Technical information about this service’s accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y gwasanaeth hwn

source: The Legal Aid Agency is committed to making its service accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (&#8470; 2) Accessibility Regulations 2018.
cy: Mae’r Asiantaeth Cymorth Cyfreithiol wedi ymrwymo i wneud ei gwasanaeth yn hygyrch, yn unol â Rheoliadau Hygyrchedd Cyrff Sector Cyhoeddus (Gwefannau a Rhaglenni Symudol) (Rhif 2) 2018.

source: Compliance status
cy: Statws cydymffurfio

source: This service is partially compliant with the %(wcag_link)s AA standard, due to the non-compliance issues listed below.
cy: Mae’r gwasanaeth hwn yn cydymffurfio’n rhannol â safon AA %(wcag_link)s, oherwydd y materion diffyg cydymffurfio a restrir isod.

source: Non-accessible content
cy: Cynnwys nad oes modd cael gafael arno

source: The content listed below is non-accessible for the following reasons.
cy: Nid oes modd cael gafael ar y cynnwys a restrir isod am y rhesymau canlynol.

source: Non-compliance with the accessibility regulations
cy: Ddim yn cydymffurfio â’r rheoliadau hygyrchedd

source: Some link text is ambiguous which might result in some users not understanding the link destination. This fails WCAG 2.2. success criterion 2.4.4 Link Purpose (In Context). We plan to ensure all link text is clear and able to be understood by all by the end of December 2025.
cy: Mae rhywfaint o destun dolen yn amwys a allai olygu nad yw rhai defnyddwyr yn deall cyrchfan y ddolen. Mae hyn yn methu WCAG 2.2 maen prawf llwyddiant 2.4.4 Diben Dolenni (Mewn Cyd-destun.) Rydym yn bwriadu sicrhau bod yr holl destun cyswllt yn glir ac yn gallu cael ei ddeall gan bawb erbyn diwedd mis Rhagfyr 2025.

source: Some page elements have incorrect aria attributes. This might cause some assistive technology users to have difficulty identifying form elements. This fails WCAG 2.2. success criterion 4.1.2 Name, Role, Value. We plan to ensure that all aria is correct by the end of December 2025.
cy: Mae gan rai elfennau tudalen briodoleddau aria anghywir. Gallai hyn achosi i rai defnyddwyr technoleg gynorthwyol ei chael hi’n anodd adnabod elfennau o’r ffurflen. Mae hyn yn methu WCAG 2.2. maen prawf llwyddiant 4.1.2 Enw, Rôl, Gwerth. Rydym yn bwriadu sicrhau bod yr holl aria yn gywir erbyn diwedd mis Rhagfyr 2025.

source: When a page is about to time out, a dialog box lets the user extend the time to complete the page and gives a countdown until the page will time out. The time left is read out every second to screen reader users which will be distracting. This fails WCAG 2.2. success criterion 4.1.3 Status messages. We plan to ensure that the timeout dialog does not announce the time remaining every second by the end of December 2025.
cy: Pan fydd tudalen ar fin dirwyn i ben, bydd blwch deialog yn gadael i'r defnyddiwr ymestyn yr amser i gwblhau'r dudalen ac yn cyfri’r amser nes bydd y dudalen yn dirwyn i ben. Mae’r amser sy’n weddill yn cael ei ddarllen yn uchel bob eiliad i ddefnyddwyr darllenydd sgrin a fydd yn tynnu eu sylw. Mae hyn yn methu WAG 2.2. maen prawf llwyddiant 4.1.3 Negeseuon Statws. Rydym yn bwriadu sicrhau nad yw’r deialog terfyn amser yn cyhoeddi’r amser sy’n weddill bob eiliad erbyn diwedd Rhagfyr 2025.

source: Time-out
cy: Terfyn amser

source: Users are not able to turn off, adjust or extend the time in which inactivity will result in a loss of data. This fails WCAG 2.1 2.2.1 A (Timing Adjustable).
cy: Ni all defnyddwyr ddiffodd, addasu nac ymestyn yr amser pan fydd anweithgarwch yn arwain at golli data. Mae hyn yn methu WCAG 2.1 2.2.1 A (Addasu’r Amseriad).

source: We are experiencing intermittent problems with the time-out feature where users are unexpectedly timed-out without the time-out warning appearing. We are currently investigating the source of this issue.
cy: Rydym yn cael problemau ysbeidiol gyda'r nodwedd terfyn amser, lle bydd amser defnyddwyr yn dod i ben yn annisgwyl heb i'r rhybudd terfyn amser ymddangos. Rydym yn ymchwilio i'r broblem hon ar hyn o bryd.

source: Hide this page
cy: Cuddio’r dudalen hon

source: The ‘Hide this page’ button does not accurately describe the link destination. This fails WCAG 2.1 1.3.1 A (Info and relationships) and 2.4.6 AA (Headings and Labels).
cy: Nid yw'r botwm ‘Cuddio'r dudalen hon’ yn disgrifio cyrchfan y ddolen yn gywir. Mae hyn yn methu WCAG 2.1 1.3.1 A (Gwybodaeth a pherthnasoedd) a 2.4.6 AA (Penawdau a Labeli).

source: We understand that ‘Hide this page’ does not describe the link destination. We have purposely designed the feature to protect vulnerable users and provide a quick exit from the service rather than take users to a specific destination.
cy: Rydym yn deall nad yw ‘Cuddio'r dudalen hon’ yn disgrifio cyrchfan y ddolen. Rydym wedi dylunio'r nodwedd yn fwriadol i ddiogelu defnyddwyr agored i niwed, a'u galluogi i adael y gwasanaeth yn gyflym yn hytrach nag arwain defnyddwyr i gyrchfan penodol.

source: Disproportionate burden
cy: Baich anghymesur

source: Not applicable
cy: Ddim yn berthnasol

source: Content that’s not within the scope of the accessibility regulations
cy: Cynnwys nad yw o fewn cwmpas y rheoliadau hygyrchedd

source: What we’re doing to improve accessibility
cy: Beth rydyn ni’n ei wneud i wella hygyrchedd

source: We are working to fix the time-out issue listed in this statement.
cy: Rydym yn gweithio i ddatrys y broblem terfyn amser a restrir yn y datganiad hwn.

source: We will monitor the accessibility of this service on an ongoing basis and fix any accessibility issues reported to us.
cy: Byddwn yn monitro hygyrchedd y gwasanaeth hwn yn barhaus ac yn datrys unrhyw broblemau hygyrchedd y rhoddir gwybod i ni amdanyn nhw.

source: Preparation of this accessibility statement
cy: Paratoi'r datganiad hygyrchedd hwn

source: This statement was prepared on %(day)s %(month)s %(year)s.
cy: Paratowyd y datganiad hwn ar %(day)s %(month)s %(year)s.

source: September
cy: Medi

source: March
cy: Mawrth

source: This statement was last reviewed in an internal review by Justice Digital’s Digital Accessibility Team in %(month)s %(year)s.
cy: Adolygwyd y datganiad hwn ddiwethaf mewn adolygiad mewnol gan Dîm Hygyrchedd Digidol Justice Digital fis %(month)s %(year)s.

source: This service was tested on %(day1)s %(month1)s %(year1)s and issues were re-tested on %(day2)s %(month2)s %(year2)s.
cy: Profwyd y gwasanaeth hwn ar %(day1)s %(month1)s %(year1)s ac ailbrofwyd y materion a oedd angen sylw ar %(day2)s %(month2)s %(year2)s.

source: July
cy: Gorffennaf

source: October
cy: Hydref

source: The tests were carried out by the Digital Accessibility Centre (<abbr>DAC</abbr>).
cy: Cynhaliwyd y profion gan y Ganolfan Hygyrchedd Digidol (<abbr>DAC</abbr>).

source: The <abbr title='Digital Accessibility Centre'>DAC</abbr> tested core journeys, key functionality and interactive features that reflect the content that the average user may encounter.
cy: Aeth y <abbr title='Ganolfan Hygyrchedd Digidol'>DAC</abbr> ati i brofi teithiau craidd, swyddogaeth allweddol a nodweddion rhyngweithiol sy'n adlewyrchu'r cynnwys y gall y defnyddiwr cyffredin ddod ar eu traws.

source: The <abbr title='Digital Accessibility Centre'>DAC</abbr> tested the service available at <a class='govuk-link' href='https://checklegalaid.service.gov.uk/'>https://checklegalaid.service.gov.uk/</a>.
cy: Mae'r <abbr title='Ganolfan Hygyrchedd Digidol'>DAC</abbr> wedi profi'r gwasanaeth sydd ar gael yn <a class='govuk-link' href='https://www.gov.uk/gwirio-os-ydych-yn-gymwys-i-gael-cymorth-cyfreithiol'>https://checklegalaid.service.gov.uk/</a>.

source: Purpose
cy: Pwrpas

source: Stay safe when you use this website
cy: Cadwch yn ddiogel wrth ddefnyddio’r wefan hon

source: If you need to hide what you’re doing on this website, or protect yourself from someone, it can be safer not to use your home computer or your own mobile phone.
cy: Os oes angen i chi guddio’r hyn rydych chi’n ei wneud ar y wefan hon, neu ddiogelu eich hun rhag rhywun, gall fod yn fwy diogel peidio â defnyddio eich cyfrifiadur gartref na’ch ffôn symudol eich hun.

source: For example, use a computer at the library, or borrow a phone from someone you trust.
cy: Er enghraifft, defnyddiwch gyfrifiadur yn y llyfrgell, neu fenthyg ffôn gan rywun rydych chi’n ymddiried ynddo.

source: What this website saves to your device
cy: Beth mae'r wefan hon yn ei gadw ar eich dyfais

source: When you use this website, and every time you use the internet, your device saves a record of:
cy: Pan fyddwch chi’n defnyddio’r wefan hon, a phob tro y byddwch chi’n defnyddio’r rhyngrwyd, bydd eich dyfais yn cadw cofnod o’r canlynol:

source: the pages you’ve looked at and the files you’ve downloaded - this is called your ‘browsing history’
cy: y tudalennau rydych chi wedi edrych arnyn nhw a'r ffeiliau rydych chi wedi'u llwytho i lawr – gelwir hyn yn 'hanes pori'

source: small files called ‘cookies’
cy: ffeiliau bach o’r enw ‘cwcis’

source: How to delete cookies and your browsing history
cy: Sut mae dileu cwcis a'ch hanes pori

source: Be careful because:
cy: Byddwch yn ofalus oherwydd:

source: deleting cookies will also delete stored passwords for online accounts
cy: bydd dileu cwcis hefyd yn dileu cyfrineiriau sydd wedi’u storio ar gyfer cyfrifon ar-lein

source: clearing your history could make someone more suspicious
cy: gallai clirio eich hanes wneud rhywun yn fwy amheus

source: Try to only remove information about the websites you want to keep private.
cy: Ceisiwch ddileu’r wybodaeth am y gwefannau rydych chi am eu cadw'n breifat yn unig.

source: Find out how to do that on:
cy: Dysgwch sut mae gwneud hynny ar:

source: How the ‘Exit this page’ button works on this website
cy: Sut mae’r botwm ‘Gadael y dudalen hon’ yn gweithio ar y wefan hon

source: There is an ‘Exit this page’ button on some pages. If you click this button, all the information you’ve entered will be deleted. This website will close.
cy: Mae botwm ‘Gadael y dudalen hon’ ar rai tudalennau. Os byddwch chi’n clicio’r botwm hwn, bydd yr holl wybodaeth rydych chi wedi’i rhoi yn cael ei dileu. Bydd y wefan hon yn cau.

source: You’ll automatically go to the BBC Weather homepage:
cy: Byddwch yn mynd yn awtomatig i dudalen hafan BBC Weather:

source: Cookies and browsing history will still be saved to your device.
cy: Bydd y cwcis a’r hanes pori yn dal i gael eu cadw ar eich dyfais.

source: On any page where you see the ‘Exit this page’ button, pressing the ‘Shift’ key 3 times will work the same way.
cy: Ar unrhyw dudalen lle gwelwch y botwm ‘Gadael y dudalen hon’, bydd pwyso’r fysell ‘Shift’ 3 gwaith yn gwneud yr un peth.

source: To find this website again, search ‘Check if you can get legal aid’.
cy: I ddod o hyd i’r wefan hon eto, chwiliwch am ‘Gwirio a ydych yn gymwys i gael cymorth cyfreithiol’.

source: How to use this website without storing cookies and browser history
cy: Sut mae defnyddio'r wefan hon heb storio cwcis a hanes pori

source: Use the ‘private browsing’ settings. Go to the menu on your browser, click on ‘File’ and turn on:
cy: Defnyddiwch y gosodiadau ‘pori’n breifat’. Ewch i’r ddewislen ar eich porwr, cliciwch ‘Ffeil’ a rhoi’r canlynol ar waith:

source: <strong>Incognito</strong> on Google Chrome
cy: <strong>Incognito</strong> ar Google Chrome

source: <strong>Private Window</strong> on Safari
cy: <strong>Private Window</strong> ar Safari

source: <strong>InPrivate</strong> on Internet Explorer
cy: <strong>InPrivate</strong> ar Internet Explorer

source: <strong>Private Browsing</strong> on Mozilla Firefox
cy: <strong>Private Browsing</strong> ar Mozilla Firefox

source: On Samsung internet, you need to turn on
cy: Ar Samsung Internet, mae angen i chi roi

source: Secret mode.
cy: Secret mode ar waith.

source: Get help to stay safe online
cy: Cael help i gadw’n ddiogel ar-lein

source: There are other ways someone can track you online, for example by using spying or tracking programmes. See the Refuge website
cy: Mae ffyrdd eraill y gall rhywun eich tracio ar-lein, er enghraifft drwy ddefnyddio rhaglenni tracio neu ysbïo. Ewch i’r dudalen

source: Secure your tech.
cy: Secure your tech ar wefan Refuge.

source: Civil Legal Advice (CLA) &ndash; Legal Aid Agency Privacy Notice
cy: Mynd yn ôl i newid atebion

source: This privacy notice sets out the standards that you can expect from the Legal Aid Agency when we request or hold personal information (‘personal data’) about you; how you can get access to a copy of your personal data; and what you can do if you think the standards are not being met.
cy: Mae’r hysbysiad preifatrwydd hon yn gosod y safonau yr allwch chi eu disgwyl gan yr Asiantaeth Cymorth Cyfreithiol pan yr ydym yn gofyn am neu yn cadw gwybodaeth bersonol (‘data personol’) amdanoch chi; sut allwch chi gael copi o’ch data personol; a beth allwch chi ei wneud os ydych chi’n meddwl nad ydym yn cwrdd â’r safonau.

source: The Legal Aid Agency is an Executive Agency of the Ministry of Justice (<abbr>MoJ</abbr>). The <abbr>MoJ</abbr> is the data controller for the personal information we hold. The Legal Aid Agency collects and processes personal data for the exercise of its own and associated public functions. Our public function is to provide legal aid.
cy: Asiantaeth Gweithredol y Weinyddiaeth Gyfiawnder ydy’r Asiantaeth Cymorth Cyfreithiol. Y Weinyddiaeth Gyfiawnder ydy’r rheolwr data ar gyfer y wybodaeth bersonol yr ydym yn ei chadw. Mae’r Asiantaeth Cymorth Cyfreithiol yn casglu ac yn prosesu data personol er mwyn arfer swyddogaethau cyhoeddus ei hun a swyddogaethau cysylltiedig. Darparu cymorth cyfreithiol ydy ein swyddogaeth gyhoeddus.
